{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "MTQSNPNEQNVELNRTSLYWGLLLIFVLAVLFSNYFFN": 5,
      "MLTLKLFVYTVVIFFVSLFIFGFLSNDPGRNPGREE": 6,
      "MDIVSLAWAALMVVFTFSLSLVVWGRSGL": 7,
      "MIEVFLFGIVLGLIPITLAGLFVTAYLQYRRGDQLDL": 8,
      "MTIDRTYPIFTVRWLAVHGLAVPTVSFLGSISAMQFIQR": 9,
      "MPVIKVRENEPFDVALRRFKRSCEKAGVLAEVRRREFYEKPTTERKRAKASAVKRHAKKLARENARRTRLY": 10,
      "MENLNMDLLYMAAAVMMGLAAIGAAIGIGILGGKFLEGAARQPDLIPLLRTQFFIVMGLVDAIPMIAVGLGLYVMFAVA": 11,
      "GSSGLISMPRV": 12,
      "MARYFRRRKFCRFTAEGVQEIDYKDIATLKNYITESGKIVPSRITGTRAKYQRQLARAIKRARYLSLLPYTDRHQ": 13,
      "MTIDRTYPIFTVRWLAVHGLAVPTVFFLGSISAMQFIQR": 14,
      "MNPLISAASVIAAGLAVGLASIGPGVGQGTAAGQAVEGIARQPEAEGKIRGTLLLSLAFMEALTIYGLVVALALLFANPFV": 15,
      "MQNQRIRIRLKAFDHRLIDQSTAEIVETAKRTGAQVRGPIPLPTRKERFTVLISPHVNKDARDQYEIRTHKRLVDIVEPTEKTVDALMRLDLAAGVDVQISLG": 16,
      "MARVTVQDAVEKIGNRFDLVLVAARRARQMQVGGKDPLVPEENDKTTVIALREIEEGLINNQILDVRERQEQQEQEAAELQAVTAIAEGRR": 17,
      "MFEQRVNSDVLTVSTVNSQDQVTQKPLRDSVKQALKNYFAQLNGQDVNDLYELVLAEVEQPLLDMVMQYTRGNQTRAALMMGINRGTLRKKLKKYGMN": 18,
      "MLILTRRVGETLMIGDEVTVTVLGVKGNQVRIGVNAPKEVSVHREEIYQRIQAEKSQQSSY": 19,
      "MFPMVTEFMNYGQQTVRAARYIGQGFMITLSHANRLPVTIQYPYEKLITSERFRGRIHFEFDKCIACEVCVRVCPIDLPVVDWKLETDIRKKRLLNYSIDFGICIFCGNCVEYCPTNCLSMTEEYELSTYDRHELNYNQIALGRLPMSIIDDYTIRTILNLPEIKT": 20,
      "MAKGIREKIKLVSSAGTGHFYTTTKNKRTKPEKLELKKFDPVVRQHVIYKEAKIK": 21,
      "METATLVAIFISGLLVSFTGYALYTAFGQPSQQLRDPFEEHGD": 22,
      "METATLVAISISGLLVSFTGYALYTAFGQPSQQLRDPFEEHGD": 23,
      "MARVKRGVIARARHKKILKQAKGYYGARSRVYRVAFQAVIKAGQYAYRDRRQRKRQFRQLWIARINAAARQNGISYSKFINGLKKASVEIDRKILADIAVFDKVAFTALVEKAKAALA": 24,
      "MELVLKDAQSALTVSETTFGRDFNEALVHQVVVAYAAGARQGTRAQKTRAEVTGSGKKPWRQKGTGRARSGSIKSPIWRSGGVTFAARPQDHSQKVNKKMYRGALKSILSELVRQDRLIVVEKFSVEAPKTKLLAQKLKDMALEDVLIITGELDENLFLAARNLHKVDVRDATGIDPVSLIAFDKVVMTADAVKQVEEMLA": 25,
      "METIAKHRHARSSAQKVRLVADLIRGKKVSQALDILTYTNKKAAVLVKKVLESAIANAEHNDGADIDDLKVTKIFVDEGPSMKRIMPRAKGRADRILKRTSHITVVVSDR": 26,
      "MGQKVHPNGIRLGIVKPWNSTWFANTKEFADNLDSDFKVRQYLTKELAKASVSRIVIERPAKSIRVTIHTARPGIVIGKKGEDVEKLRKVVADIAGVPAQINIAEVRKPELDAKLVADSITSQLERRVMFRRAMKRAVQNAMRLGAKGIKVEVSGRLGGAEIARTEWYREGRVPLHTLRADIDYNTSEAHTTYGVIGVKVWIFKGEILGGMAAVEQPEKPAAQPKKQQRKGRK": 27,
      "MKRTFQPSVLKRNRSHGFRARMATKNGRQVLARRRAKGRARLTVSK": 28,
      "MSHSVKIYDTCIGCTQCVRACPTDVLEMIPWDGCKAKQIASAPRTEDCVGCKRCESACPTDFLSVRVYLWHETTRSMGLAY": 29,
      "MSMQDPIADMLTRIRNGQAANKAAVTMPSSKLKVAIANVLKEEGFIEDFKVEGDTKPELELTLKYFQGKAVVESIQRVSRPGLRIYKRKDELPKVMAGLGIAVVSTSKGVMTDRAARQAGLGGEIICYVA": 30,
      "MAKKVQAYVKLQVAAGMANPSPPVGPALGQQGVNIMEFCKAFNAKTDSIEKGLPIPVVITVYADRSFTFVTKTPPAAVLLKKAAGIKSGSGKPNKDKVGKISRAQLQEIAQTKAADMTGADIEAMTRSIEGTARSMGLVVED": 31,
      "MRLNTLSPAEGSKKAGKRLGRGIGSGLGKTGGRGHKGQKSRSGGGVRRGFEGGQMPLYRRLPKFGFTSRKAAITAEVRLSDLAKVEGGVVDLNTLKAANIIGIQIEFAKVILAGEVTTPVTVRGLRVTKGARAAIEAAGGKIEE": 32,
      "MSTIEERVKKIIGEQLGVKQEEVTNNASFVEDLGADSLDTVELVMALEEEFDTEIPDEEAEKITTVQAAIDYINGHQA": 33,
      "GSSGMIPFPRV": 34,
      "MFGKGGLGNLMKQAQQMQEKMQKMQEEIAQLEVTGESGAGLVKVTINGAHNCRRVEIDPSLLEDDKEMLEDLVAAAFNDAARRIEETQKEKMASVSSGMQLPPGFKMPF": 35,
      "MKTFTAKPETVKRDWYVVDATGKTLGRLATELARRLRGKHKAEYTPHVDTGDYIIVLNADKVAVTGNKRTDKVYYHHTGHIGGIKQATFEEMIARRPERVIEIAVKGMLPKGPLGRAMFRKLKVYAGNEHNHAAQQPQVLDI": 36,
      "MATVNQLVRKPRARKVAKSNVPALEACPQKRGVCTRVYTTTPKKPNSALRKVCRVRLTNGFEVTSYIGGEGHNLQEHSVILIRGGRVKDLPGVRYHTVRGALDCSGVKDRKQARSKYGVKRPKA": 37,
      "MPKIKTVRGAAKRFKKTGKGGFKHKHANLRHILTKKATKRKRHLRPKAMVSKGDLGLVIACLPYA": 38,
      "MARYRRHSRSRSRSRYRRRRRRRSRHHNRRRTYRRSRRHSRRRRGRRRGYSRRRYSRRGRRRY": 39,
      "MEVNILAFIATALFILVPTAFLLIIYVKTVSQND": 40,
      "MAAKIRRDDEVIVLTGKDKGKRGKVKNVLSSGKVIVEGINLVKKHQKPVPALNQPGGIVEKEAAIQVSNVAIFNAATGKADRVGFRFEDGKKVRFFKSNSETIK": 41,
      "MKIRASVRKICEKCRLIRRRGRIIVICSNPRHKQRQG": 42,
      "MDKKSARIRRATRARRKLQELGATRLVVHRTPRHIYAQVIAPNGSEVLVAASTVEKAIAEQLKYTGNKDAAAAVGKAVAERALEKGIKDVSFDRSGFQYHGRVQALADAAREAGLQF": 43,
      "MAKAPIRARKRVRKQVSDGVAHIHASFNNTIVTITDRQGNALGWATAGGSGFRGSRKSTPFAAQVAAERCADAVKEYGIKNLEVMVKGPGPGRESTIRALNAAGFRITNITDVTPIPHNGCRPPKKRRV": 44,
      "MAKLHDYYKDEVVKKLMTEFNYNSVMQVPRVEKITLNMGVGEAIADKKLLDNAAADLAAISGQKPLITKARKSVAGFKIRQGYPIGCKVTLRGERMWEFFERLITIAVPRIRDFRGLSAKSFDGRGNYSMGVREQIIFPEIDYDKVDRVRGLDITITTTAKSDEEGRALLAAFDFPFRK": 45,
      "MALNLQDKQAIVAEVSEVAKGALSAVVADSRGVTVDKMTELRKAGREAGVYMRVVRNTLLRRAVEGTPFECLKDAFVGPTLIAYSMEHPGAAARLFKEFAKANAKFEVKAAAFEGELIPASQIDRLATLPTYEEAIARLMATMKEASAGKLVRTLAAVRDAKEAA": 46,
      "MAVQQNKPTRSKRGMRRSHDALTAVTSLSVDKTSGEKHLRHHITADGYYRGRKVIAK": 47,
      "MIRTMLQGKLHRVKVTHADLHYEGSCAIDQDFLDAAGILENEAIDIWNVTNGKRFSTYAIAAERGSRIISVNGAAAHCASVGDIVIIASFVTMPDEEARTWRPNVAYFEGDNEMKRTAKAIPVQVA": 48,
      "MPRSLKKGPFIDLHLLKKVEKAVESGDKKPLRTWSRRSTIFPNMIGLTIAVHNGRQHVPVFVTDEMVGHKLGEFAPTRTYRGHAADKKAKKK": 49,
      "MSNIIKQLEQEQMKQDVPSFRPGDTVEVKVWVVEGSKKRLQAFEGVVIAIRNRGLHSAFTVRKISNGEGVERVFQTHSPVVDSISVKRRGAVRKAKLYYLRERTGKAARIKERLN": 50,
      "MAKEFGRPQRVAQEMQKEIALILQREIKDPRLGMMTTVSGVEMSRDLAYAKVYVTFLNDKDEDAVKAGIKALQEASGFIRSLLGKAMRLRIVPELTFFYDNSLVEGMRMSNLVTSVVKHDEERRVNPDDSKED": 51,
      "MALLDFFLSRKKNTANIAKERLQIIVAERRRSDAEPHYLPQLRKDILEVICKYVQIDPEMVTVQLEQKDGDISILELNVTLPEAEELK": 52,
      "MATYYSNDFRAGLKIMLDGEPYAVEASEFVKPGKGQAFARVKLRRLLTGTRVEKTFKSTDSAEGADVVDMNLTYLYNDGEFWHFMNNETFEQLSADAKAIGDNAKWLLDQAECIVTLWNGQPISVTPPNFVELEIVDTDPGLKGDTAGTGGKPATLSTGAVVKVPLFVQIGEVIKVDTRSGEYVSRVK": 53,
      "MIPLQHGLILAAILFVLGLTGLVIRRNLLFMLIGLEIMINASALAFVVAGSYWGQTDGQVMYILAISLAAAEASIGLALLLQLHRRRQNLNIDSVSEMRG": 54,
      "MKALTARQQEVFDLIRDHISQTGMPPTRAEIAQRLGFRSPNAAEEHLKALARKGVIEIVSGASRGIRLLQEEEEGLPLVGRVAAGEPLLAQQHIEGHYQVDPSLFKPNADFLLRVSGMSMKDIGIMDGDLLAVHKTQDVRNGQVVVARIDDEVTVKRLKKQGNKVELLPENSEFKPIVVDLRQQSFTIEGLAVGVIRNGDWL": 55,
      "MKLQLVAVGTKMPDWVQTGFTEYLRRFPKDMPFELIEIPAGKRGKNADIKRILDKEGEQMLAAAGKNRIVTLDIPGKPWDTPQLAAELERWKLDGRDVSLLIGGPEGLSPACKAAAEQSWSLSALTLPHPLVRVLVAESLYRAWSITTNHPYHRE": 56,
      "MNPIVINRLQRKLGYTFNHQELLQQALTHRSASSKHNERLEFLGDSILSYVIANALYHRFPRVDEGDMSRMRATLVRGNTLAELAREFELGECLRLGPGELKSGGFRRESILADTVEALIGGVFLDSDIQTVEKLILNWYQTRLDEISPGDKQKDPKTRLQEYLQGRHLPLPTYLVVQVRGEAHDQEFTIHCQVSGLSEPVVGTGSSRRKAEQAAAEQALKKLELE": 57,
      "MPSLSKEAALVHEALVARGLETPLRPPVHEMDNETRKSLIAGHMTEIMQLLNLDLADDSLMETPHRIAKMYVDEIFSGLDYANFPKITLIENKMKVDEMVTVRDITLTSTCEHHFVTIDGKATVAYIPKDSVIGLSKINRIVQFFAQRPQVQERLTQQILIALQTLLGTNNVAVSIDAVHYCVKARGIRDATSATTTTSLGGLFKSSQNTRHEFLRAVRHHN": 58,
      "MQKFDTRTFQGLILTLQDYWARQGCTIVQPLDMEVGAGTSHPMTCLRALGPEPMAAAYVQPSRRPTDGRYGENPNRLQHYYQFQVVIKPSPDNIQELYLGSLKELGMDPTIHDIRFVEDNWENPTLGAWGLGWEVWLNGMEVTQFTYFQQVGGLECKPVTGEITYGLERLAMYIQGVDSVYDLVWSDGPLGKTTYGDVFHQNEVEQSTYNFEYADVDFLFTCFEQYEKEAQQLLALENPLPLPAYERILKAAHSFNLLDARKAISVTERQRYILRIRTLTKAVAEAYYASREALGFPMCNKDK": 59,
      "MSDDVALPLEFTDAAANKVKSLIADEDNPNLKLRVYITGGGCSGFQYGFTFDDQVNEGDMTIEKQGVGLVVDPMSLQYLVGGSVDYTEGLEGSRFIVTNPNAKSTCGCGSSFSI": 60,
      "MSNVPAELKYSKEHEWLRKEADGTYTVGITEHAQELLGDMVFVDLPEVGATVSAGDDCAVAESVKAASDIYAPVSGEIVAVNDALSDSPELVNSEPYAGGWIFKIKASDESELESLLDATAYEALLEDE": 61,
      "MTDKIRTLQGRVVSDKMEKSIVVAIERFVKHPIYGKFIKRTTKLHVHDENNECGIGDVVEIRECRPLSKTKSWTLVRVVEKAVL": 62,
      "MTGKKRSASSSRWLQEHFSDKYVQQAQKKGLRSRAWFKLDEIQQSDKLFKPGMTVVDLGAAPGGWSQYVVTQIGGKGRIIACDLLPMDPIVGVDFLQGDFRDELVMKALLERVGDSKVQVVMSDMAPNMSGTPAVDIPRAMYLVELALEMCRDVLAPGGSFVVKVFQGEGFDEYLREIRSLFTKVKVRKPDSSRARSREVYIVATGRKP": 63,
      "MAEITASLVKELRERTGAGMMDCKKALTEANGDIELAIENMRKSGAIKAAKKAGNVAADGVIKTKIDGNYGIILEVNCQTDFVAKDAGFQAFADKVLDAAVAGKITDVEVLKAQFEEERVALVAKIGENINIRRVAALEGDVLGSYQHGARIGVLVAAKGADEELVKHIAMHVAASKPEFIKPEDVSAEVVEKEYQVQLDIAMQSGKPKEIAEKMVEGRMKKFTGEVSLTGQPFVMEPSKTVGQLLKEHNAEVTGFIRFEVGEGIEKVETDFAAEVAAMSKQS": 64,
      "MALTKAEMSEYLFDKLGLSKRDAKELVELFFEEIRRALENGEQVKLSGFGNFDLRDKNQRPGRNPKTGEDIPITARRVVTFRPGQKLKSRVENASPKDE": 65,
      "MDWLAKYWWILVIVFLVGVLLNVIKDLKRVDHKKFLANKPELPPHRDFNDKWDDDDDWPKKDQPKK": 66,
      "MIGLVGKKVGMTRIFTEDGVSIPVTVIEVEANRVTQVKDLANDGYRAIQVTTGAKKANRVTKPEAGHFAKAGVEAGRGLWEFRLAEGEEFTVGQSISVELFADVKKVDVTGTSKGKGFAGTVKRWNFRTQDATHGNSLSHRVPGSIGQNQTPGKVFKGKKMAGQMGNERVTVQSLDVVRVDAERNLLLVKGAVPGATGSDLIVKPAVKA": 67,
      "MIQEQTMLNVADNSGARRVMCIKVLGGSHRRYAGVGDIIKITIKEAIPRGKVKKGDVLKAVVVRTKKGVRRPDGSVIRFDGNACVLLNNNSEQPIGTRIFGPVTRELRSEKFMKIISLAPEVL": 68,
      "MLQPKRTKFRKMHKGRNRGLAQGTDVSFGSFGLKAVGRGRLTARQIEAARRAMTRAVKRQGKIWIRVFPDKPITEKPLAVRMGKGKGNVEYWVALIQPGKVLYEMDGVPEELAREAFKLAAAKLPIKTTFVTKTVM": 69,
      "MNTPAQLSLPLYLPDDETFASFWPGDNSSLLAALQNVLRQEHSGYIYLWAREGAGRSHLLHAACAELSQRGDAVGYVPLDKRTWFVPEVLDGMEHLSLVCIDNIECIAGDELWEMAIFDLYNRILESGKTRLLITGDRPPRQLNLGLPDLASRLDWGQIYKLQPLSDEDKLQALQLRARLRGFELPEDVGRFLLKRLDREMRTLFMTLDQLDRASITAQRKLTIPFVKEILKL": 70,
      "MQVILLDKVANLGSLGDQVNVKAGYARNFLVPQGKAVPATKKNIEFFEARRAELEAKLAEVLAAANARAEKINALETVTIASKAGDEGKLFGSIGTRDIADAVTAAGVEVAKSEVRLPNGVLRTTGEHEVSFQVHSEVFAKVIVNVVAE": 71,
      "MRNFDLSPLYRSAIGFDRLFNHLENNQSQSNGGYPPYNVELVDENHYRIAIAVAGFAESELEITAQDNLLVVKGAHADEQKERTYLYQGIAERNFERKFQLAENIHVRGANLVNGLLYIDLERVIPEAKKPRRIEIN": 72,
      "MSRTIFCTFLQREAEGQDFQLYPGELGKRIYNEISKEAWAQWQHKQTMLINEKKLNMMNAEHRKLLEQEMVNFLFEGKEVHIEGYTPEDKK": 73,
      "MSRVAKAPVVVPAGVDVKINGQVITIKGKNGELTRTLNDAVEVKHADNTLTFGPRDGYADGWAQAGTARALLNSMVIGVTEGFTKKLQLVGVGYRAAVKGNVINLSLGFSHPVDHQLPAGITAECPTQTEIVLKGADKQVIGQVAADLRAYRRPEPYKGKGVRYADEVVRTKEAKKK": 74,
      "MTKKKAHKPGSATIALNKRARHEYFIEEEFEAGLALQGWEVKSLRAGKANISDSYVLLRDGEAFLFGANITPMAVASTHVVCDPTRTRKLLLNQRELDSLYGRVNREGYTVVALSLYWKNAWCKVKIGVAKGKKQHDKRSDIKEREWQVDKARIMKNAHR": 75,
      "MVIKAQSPAGFAEEYIIESIWNNRFPPGTILPAERELSELIGVTRTTLREVLQRLARDGWLTIQHGKPTKVNNFWETSGLNILETLARLDHESVPQLIDNLLSVRTNISTIFIRTAFRQHPDKAQEVLATANEVADHADAFAELDYNIFRGLAFASGNPIYGLILNGMKGLYTRIGRHYFANPEARSLALGFYHKLSALCSEGAHDQVYETVRRYGHESGEIWHRMQKNLPGDLAIQGR": 76,
      "MYDNLKSLGITNPEEIDRYSLRQEANNDILKIYFQKDKGEFFAKSVKFKYPRQRKTVVADGVGQGYKEVQEISPNLRYIIDELDQICQRDRSEVDLKRKILDDLRHLESVVTNKISEIEADLEKLTRK": 77,
      "MAAKDVKFGNDARVKMLRGVNVLADAVKVTLGPKGRNVVLDKSFGAPTITKDGVSVAREIELEDKFENMGAQMVKEVASKANDAAGDGTTTATVLAQAIITEGLKAVAAGMNPMDLKRGIDKAVTAAVEELKALSVPCSDSKAIAQVGTISANSDETVGKLIAEAMDKVGKEGVITVEDGTGLQDELDVVEGMQFDRGYLSPYFINKPETGAVELESPFILLADKKISNIREMLPVLEAVAKAGKPLLIIAEDVEGEALATLVVNTMRGIVKVAAVKAPGFGDRRKAMLQDIATLTGGTVISEEIGMELEKATLEDLGQAKRVVINKDTTTIIDGVGEEAAIQGRVAQIRQQIEEATSDYDREKLQERVAKLAGGVAVIKVGAATEVEMKEKKARVEDALHATRAAVEEGVVAGGGVALIRVASKLADLRGQNEDQNVGIKVALRAMEAPLRQIVLNCGEEPSVVANTVKGGDGNYGYNAATEEYGNMIDMGILDPTKVTRSALQYAASVAGLMITTECMVTDLPKNDAADLGAAGGMGGMGGMGGMM": 78,
      "MAENQYYGTGRRKSSAARVFIKPGNGKIVINQRSLEQYFGRETARMVVRQPLELVDMVEKLDLYITVKGGGISGQAGAIRHGITRALMEYDESLRSELRKAGFVTRDARQVERKKVGLRKARRRPQFSKR": 79,
      "MAKTIKITQTRSAIGRLPKHKATLLGLGLRRIGHTVEREDTPAIRGMINAVSFMVKVEE": 80,
      "MANPLYQKHIISINDLSRDDLNLVLATAAKLKANPQPELLKHKVIASCFFEASTRTRLSFETSMHRLGASVVGFSDSANTSLGKKGETLADTISVISTYVDAIVMRHPQEGAARLATEFSGNVPVLNAGDGSNQHPTQTLLDLFTIQETQGRLDNLHVAMVGDLKYGRTVHSLTQALAKFDGNRFYFIAPDALAMPQYILDMLDEKGIAWSLHSSIEEVMAEVDILYMTRVQKERLDPSEYANVKAQFVLRASDLHNAKANMKVLHPLPRVDEIATDVDKTPHAWYFQQAGNGIFARQALLALVLNRDLVL": 81,
      "MARTTPIARYRNIGISAHIDAGKTTTTERILFYTGVNHKIGEVHDGAATMDWMEQEQERGITITSAATTAFWSGMAKQYEPHRINIIDTPGHVDFTIEVERSMRVLDGAVMVYCAVGGVQPQSETVWRQANKYKVPRIAFVNKMDRMGANFLKVVNQIKTRLGANPVPLQLAIGAEEHFTGVVDLVKMKAINWNDADQGVTFEYEDIPADMVELANEWHQNLIESAAEASEELMEKYLGGEELTEAEIKGALRQRVLNNEIILVTCGSAFKNKGVQAMLDAVIDYLPSPVDVPAINGILDDGKDTPAERHASDDEPFSALAFKIATDPFVGNLTFFRVYSGVVNSGDTVLNSVKAARERFGRIVQMHANKREEIKEVRAGDIAAAIGLKDVTTGDTLCDPDAPIILERMEFPEPVISIAVEPKTKADQEKMGLALGRLAKEDPSFRVWTDEESNQTIIAGMGELHLDIIVDRMKREFNVEANVGKPQVAYRETIRQKVTDVEGKHAKQSGGRGQYGHVVIDMYPLEPGSNPKGYEFINDIKGGVIPGEYIPAVDKGIQEQLKAGPLAGYPVVDMGIRLHFGSYHDVDSSELAFKLAASIAFKEGFKKAKPVLLEPIMKVEVETPEENTGDVIGDLSRRRGMLKGQESEVTGVKIHAEVPLSEMFGYATQLRSLTKGRASYTMEFLKYDEAPSNVAQAVIEARGK": 82,
      "MARYLGPKLKLSRREGTDLFLKSGVRAIDTKCKIEQAPGQHGARKPRLSDYGVQLREKQKVRRIYGVLERQFRNYYKEAARLKGNTGENLLALLEGRLDNVVYRMGFGATRAEARQLVSHKAIMVNGRVVNIASYQVSPNDVVSIREKAKKQSRVKAALELAEQREKPTWLEVDAGKMEGTFKRKPERSDLSADINEHLIVELYSK": 83,
      "MATGKIVQVIGAVVDVEFPQDAVPRVYDALEVQNGNERLVLEVQQQLGGGIVRTIAMGSSDGLRRGLDVKDLEHPIEVPVGKATLGRIMNVLGEPVDMKGEIGEEERWAIHRAAPSYEELSNSQELLETGIKVIDLMCPFAKGGKVGLFGGAGVGKTVNMMELIRNIAIEHSGYSVFAGVGERTREGNDFYHEMTDSNVIDKVSLVYGQMNEPPGNRLRVALTGLTMAEKFRDEGRDVLLFVDNIYRYTLAGTEVSALLGRMPSAVGYQPTLAEEMGVLQERITSTKTGSITSVQAVYVPADDLTDPSPATTFAHLDATVVLSRQIASLGIYPAVDPLDSTSRQLDPLVVGQEHYDTARGVQSILQRYQELKDIIAILGMDELSEEDKLVVARARKIQRFLSQPFFVAEVFTGSPGKYVSLKDTIRGFKGIMEGEYDHLPEQAFYMVGSIEEAVEKAKKL": 84,
      "MAVVKCKPTSPGRRHVVKVVNPELHKGKPFAPLLEKNSKSGGRNNNGRITTRHIGGGHKQAYRIVDFKRNKDGIPAVVERLEYDPNRSANIALVLYKDGERRYILAPKGLKAGDQIQSGVDAAIKPGNTLPMRNIPVGSTVHNVEMKPGKGGQLARSAGTYVQIVARDGAYVTLRLRSGEMRKVEADCRATLGEVGNAEHMLRVLGKAGAARWRGVRPTVRGTAMNPVDHPHGGGEGRNFGKHPVTPWGVQTKGKKTRSNKRTDKFIVRRRSK": 85,
      "MDHRLLEIIACPVCNGKLWYNQEKQELICKLDNLAFPLRDGIPVLLETEARVLTADESKS": 86,
      "MDYTLTRIDPNGENDRYPLQKQEIVTDPLEQEVNKNVFMGKLNDMVNWGRKNSIWPYNFGLSCCYVEMVTSFTAVHDVARFGAEVLRASPRQADLMVVAGTCFTKMAPVIQRLYDQMLEPKWVISMGACANSGGMYDIYSVVQGVDKFIPVDVYIPGCPPRPEAYMQALMLLQESIGKERRPLSWVVGDQGVYRANMQSERERKRGERIAVTNLRTPDEI": 87,
      "MIRISDAAQAHFAKLLANQEEGTQIRVFVINPGTPNAECGVSYCPPDAVEATDTALKFDLLTAYVDELSAPYLEDAEIDFVTDQLGSQLTLKAPNAKMRKVADDAPLMERVEYMLQSQINPQLAGHGGRVSLMEITEDGYAILQFGGGCNGCSMVDVTLKEGIEKQLLNEFPELKGVRDLTEHQRGEHSYY": 88,
      "MKIGIIGAMEEEVTLLRDKIENRQTISLGGCEIYTGQLNGTEVALLKSGIGKVAAALGATLLLEHCKPDVIINTGSAGGLAPTLKVGDIVVSDEARYHDADVTAFGYEYGQLPGCPAGFKADDKLIAAAEACIAELNLNAVRGLIVSGDAFINGSVGLAKIRHNFPQAIAVEMEATAIAHVCHNFNVPFVVVRAISDVADQQSHLSFDEFLAVAAKQSSLMVESLVQKLAHG": 89,
      "MKKDIHPKYEEITASCSCGNVMKIRSTVGHDLNLDVCSKCHPFFTGKQRDVATGGRVDRFNKRFNIPGSK": 90,
      "MKPAARRRARECAVQALYSWQLSQNDIADVEYQFLAEQDVKDVDVLYFRELLAGVATNTAYLDGLMKPYLSRLLEELGQVEKAVLRIALYELSKRSDVPYKVAINEAIELAKSFGAEDSHKFVNGVLDKAAPVIRPNKK": 91,
      "MKTKLNELLEFPTPFTYKVMGQALPELVDQVVEVVQRHAPGDYTPTVKPSSKGNYHSVSITINATHIEQVETLYEELGKIDIVRMVL": 92,
      "MLDPNLLRNEPDAVAEKLARRGFKLDVDKLGALEERRKVLQVKTENLQAERNSRSKSIGQAKARGEDIEPLRLEVNKLGEELDAAKAELDALQAEIRDIALTIPNLPADEVPVGKDENDNVEVSRWGTPREFDFEVRDHVTLGEMHSGLDFAAAVKLTGSRFVVMKGQIARMHRALSQFMLDLHTEQHGYSENYVPYLVNQDTLYGTGQLPKFAGDLFHTRPLEEEADTSNYALIPTAEVPLTNLVRGEIIDEDDLPIKMTAHTPCFRSEAGSYGRDTRGLIRMHQFDKVEMVQIVRPEDSMAALEEMTGHAEKVLQLLGLPYRKIILCTGDMGFGACKTYDLEVWIPAQNTYREISSCSNVWDFQARRMQARCRSKSDKKTRLVHTLNGSGLAVGRTLVAVMENYQQADGRIEVPEVLRPYMNGLEYIG": 93,
      "MLKTISPLISPELLKVLAEMGHGDEIIFSDAHFPAHSMGPQVIRADGLLVSDLLQAIIPLFELDSYAPPLVMMAAVEGDTLDPEVERRYRNALSLQAPCPDIIRINRFAFYERAQKAFAIVITGERAKYGNILLKKGVTP": 94,
      "MRHRKSGRQLNRNSSHRQAMFRNMAGSLVRHEIIKTTLPKAKELRRVVEPLITLAKTDSVANRRLAFARTRDNEIVAKLFNELGPRFASRAGGYTRILKCGFRAGDNAPMAYIELVDRSEKAEAAAE": 95,
      "MSKPIVMERGVKYRDADKMALIPVKNVATEREALLRKPEWMKIKLPADSTRIQGIKAAMRKNGLHSVCEEASCPNLAECFNHGTATFMILGAICTRRCPFCDVAHGRPVAPDANEPVKLAQTIADMALRYVVITSVDRDDLRDGGAQHFADCITAIREKSPQIKIETLVPDFRGRMDRALDILTATPPDVFNHNLENVPRIYRQVRPGADYNWSLKLLERFKEAHPEIPTKSGLMVGLGETNEEIIEVMRDLRRHGVTMLTLGQYLQPSRHHLPVQRYVSPDEFDEMKAEALAMGFTHAACGPFVRSSYHADLQAKGMEVK": 96,
      "MSQLTHINAAGEAHMVDVSAKAETVREARAEAFVTMRSETLAMIIDGRHHKGDVFATARIAGIQAAKRTWDLIPLCHPLMLSKVEVNLQAEPEHNRVRIETLCRLTGKTGVEMEALTAASVAALTIYDMCKAVQKDMVIGPVRLLAKSGGKSGDFKVEADD": 97,
      "MVLMIVSGRSGSGKSVALRALEDMGFYCVDNLPVVLLPDLARTLADREISAAVSIDVRNMPESPEIFEQAMSNLPDAFSPQLLFLDADRNTLIRRYSDTRRLHPLSSKNLSLESAIDKESDLLEPLRSRADLIVDTSEMSVHELAEMLRTRLLGKRERELTMVFESFGFKHGIPIDADYVFDVRFLPNPHWDPKLRPMTGLDKPVAAFLDRHTEVHNFIYQTRSYLELWLPMLETNNRSYLTVAIGCTGGKHRSVYIAEQLADYFRSRGKNVQSRHRTLEKRKP": 98,
      "MVTIRLARHGAKKRPFYQVVVADSRNARNGRFIERVGFFNPIASEKEEGTRLDLDRIAHWVGQGATISDRVAALIKEVNKAA": 99,
      "QVNFSPGWGT": 100,
      "MAHKKAGGSTRNGRDSEAKRLGVKRFGGESVLAGSIIVRQRGTKFHAGANVGCGRDHTLFAKADGKVKFEVKGPKNRKFISIEAE": 101,
      "MAIDENKQKALAAALGQIEKQFGKGSIMRLGEDRSMDVETISTGSLSLDIALGAGGLPMGRIVEIYGPESSGKTTLTLQVIAAAQREGKTCAFIDAEHALDPIYARKLGVDIDNLLCSQPDTGEQALEICDALARSGAVDVIVVDSVAALTPKAEIEGEIGDSHMGLAARMMSQAMRKLAGNLKQSNTLLIFINQIRMKIGVMFGNPETTTGGNALKFYASVRLDIRRIGAVKEGENVVGSETRVKVVKNKIAAPFKQAEFQILYGEGINFYGELVDLGVKEKLIEKAGAWYSYKGEKIGQGKANATAWLKDNPETAKEIEKKVRELLLSNPNSTPDFSVDDSEGVAETNEDF": 102,
      "MAMTYHLDVVSAEQQMFSGLVEKIQVTGSEGELGIYPGHAPLLTAIKPGMIRIVKQHGHEEFIYLSGGILEVQPGNVTVLADTAIRGQDLDEARAMEAKRKAEEHISSSHGDVDYAQASAELAKAIAQLRVIELTKKAM": 103,
      "MAVTKLVLVRHGESQWNKENRFTGWYDVDLSEKGVSEAKAAGKLLKEEGYSFDFAYTSVLKRAIHTLWNVLDELDQAWLPVEKSWKLNERHYGALQGLNKAETAEKYGDEQVKQWRRGFAVTPPELTKDDERYPGHDPRYAKLSEKELPLTESLALTIDRVIPYWNETILPRMKSGERVIIAAHGNSLRALVKYLDNMSEEEILELNIPTGVPLVYEFDENFKPLKRYYLGNADEIAAKAAAVANQGKAK": 104,
      "MGKTNDWLDFDQLAEEKVRDALKPPSMYKVILVNDDYTPMEFVIDVLQKFFSYDVERATQLMLAVHYQGKAICGVFTAEVAETKVAMVNKYARENEHPLLCTLEKA": 105,
      "MHCPFCFAVDTKVIDSRLVGEGSSVRRRRQCLVCNERFTTFEVAELVMPRVVKSNDVREPFNEEKLRSGMLRALEKRPVSSDDVEMAINHIKSQLRATGEREVPSKMIGNLVMEQLKKLDKVAYIRFASVYRSFEDIKEFGEEIARLED": 106,
      "MIALIQRVTRASVTVEGEVTGEIGAGLLVLLGVEKDDDEQKANRLCERVLGYRIFSDAEGKMNLNVQQAGGSVLVVSQFTLAADTERGMRPSFSKGASPDRAEALYDYFVERCRQQEMNTQTGRFAADMQVSLVNDGPVTFWLQV": 107,
      "MISDIRKDAEVRMDKCVEAFKTQISKIRTGRASPSLLDGIVVEYYGTPTPLRQLASVTVEDSRTLKINVFDRSMSPAVEKAIMASDLGLNPNSAGSDIRVPLPPLTEERRKDLTKIVRGEAEQARVAVRNVRRDANDKVKALLKDKEISEDDDRRSQDDVQKLTDAAIKKIEAALADKEAELMQF": 108,
      "MISTVALFWALCVVCIVNMARYFSSLRALLVVLRNCDPLLYQYVDGGGFFTSHGQPNKQVRLVWYIYAQRYRDHHDDEFIRRCERVRRQFILTSALCGLVVVSLIALMIWH": 109,
      "MKAKELREKSVEELNTELLNLLREQFNLRMQAASGQLQQSHLLKQVRRDVARVKTLLNEKAGA": 110,
      "MKKKILAFGLISALFCSTPAMADMNRTTKGALLGAGVGLLTGNGVNGVLKGAAVGAGVGAVTEKGRDGKNARKGAKVGAAVGAVTGVLTGNGLEGAIKGAVIGGTGGAILGKMK": 111,
      "MKVNDRVTVKTDGGPRRPGVVLAVEEFSEGTMYLVSLEDYPLGIWFFNEAGHQDGIFVEKAE": 112,
      "MKYDTSELCDIYQEDVNVVEPLFSNFGGRASFGGQIITVKCFEDNGLLYDLLEQNGRGRVLVVDGGGSVRRALVDAELARLAVQNEWEGLVIYGAVRQVDDLEELDIGIQAMAAIPVGAAGEGIGESDVRVNFGGVTFFSGDHLYADNTGIILSEDPLDIE": 113,
      "MNIIEANVATPDARVAITIARFNNFINDSLLEGAIDALKRIGQVKDENITVVWVPGAYELPLAAGALAKTGKYDAVIALGTVIRGGTAHFEYVAGGASNGLAHVAQDSEIPVAFGVLTTESIEQAIERAGTKAGNKGAEAALTALEMINVLKAIKA": 114,
      "MNIRPLHDRVIVKRKEVETKSAGGIVLTGSAAAKSTRGEVLAVGNGRILENGEVKPLDVKVGDIVIFNDGYGVKSEKIDNEEVLIMSESDILAIVEA": 115,
      "MPRRRVIGQRKILPDPKFGSELLAKFVNILMVDGKKSTAESIVYSALETLAQRSGKSELEAFEVALENVRPTVEVKSRRVGGSTYQVPVEVRPVRRNALAMRWIVEAARKRGDKSMALRLANELSDAAENKGTAVKKREDVHRMAEANKAFAHYRW": 116,
      "MQLNSTEISELIKQRIAQFNVVSEAHNEGTIVSVSDGVIRIHGLADCMQGEMISLPGNRYAIALNLERDSVGAVVMGPYADLAEGMKVKCTGRILEVPVGRGLLGRVVNTLGAPIDGKGPLDHDGFSAVEAIAPGVIERQSVDQPVQTGYKAVDSMIPIGRGQRELIIGDRQTGKTALAIDAIINQRDSGIKCIYVAIGQKASTISNVVRKLEEHGALANTIVVVATASESAALQYLAPYAGCAMGEYFRDRGEDALIIYDDLSKQAVAYRQISLLLRRPPGREAFPGDVFYLHSRLLERAARVNAEYVEAFTKGEVKGKTGSLTALPIIETQAGDVSAFVPTNVISITDGQIFLETNLFNAGIRPAVNPGISVSRVGGAAQTKIMKKLSGGIRTALAQYRELAAFSQFASDLDDATRKQLDHGQKVTELLKQKQYAPMSVAQQSLVLFAAERGYLADVELSKIGSFEAALLAYVDRDHAPLMQEINQTGGYNDEIEGKLKGILDSFKATQSW": 117,
      "MSAQPVDIQIFGRSLRVNCPPDQRDALNQAADDLNQRLQDLKERTRVTNTEQLVFIAALNISYELAQEKAKTRDYAASMEQRIRMLQQTIEQALLEQGRITEKTNQNFE": 118,
      "MSDSQTLVVKLGTSVLTGGSRRLNRAHIVELVRQCAQLHAAGHRIVIVTSGAIAAGREHLGYPELPATIASKQLLAAVGQSRLIQLWEQLFSIYGIHVGQMLLTRADMEDRERFLNARDTLRALLDNNIVPVINENDAVATAEIKVGDNDNLSALAAILAGADKLLLLTDQKGLYTADPRSNPQAELIKDVYGIDDALRAIAGDSVSGLGTGGMSTKLQAADVACRAGIDTIIAAGSKPGVIGDVMEGISVGTLFHAQATPLENRKRWIFGAPPAGEITVDEGATAAILERGSSLLPKGIKSVTGNFSRGEVIRICNLEGRDIAHGVSRYNSDALRRIAGHHSQEIDAILGYEYGPVAVHRDDMITR": 119,
      "MSRVCQVTGKRPVTGNNRSHALNATKRRFLPNLHSHRFWVESEKRFVTLRVSAKGMRVIDKKGIDTVLAELRARGEKY": 120,
      "EQFEDYGHMRF": 121,
      "MADQLTEEQIAEFKEAFSLFDKDGDGTITTKELGTVMRSLGQNPTEAELQDMINEVDADGNGTIDFPEFLTMMARKMKDTDSEEEIREAFRVFDKDGNGYISAAELRHVMTNLGEKLTDEEVDEMIREADIDGDGQVNYEEFVQMMTAK": 122,
      "MAKQSMKAREVKRVALADKYFAKRAELKAIISDVNASDEDRWNAVLKLQTLPRDSSPSRQRNRCRQTGRPHGFLRKFGLSRIKVREAAMRGEIPGLKKASW": 123,
      "MAMKKLLIASLLFSSATVYGAEGFVVKDIHFEGLQRVAVGAALLSMPVRTGDTVNDEDISNTIRALFATGNFEDVRVLRDGDTLLVQVKERPTIASITFSGNKSVKDDMLKQNLEASGVRVGESLDRTTIADIEKGLEDFYYSVGKYSASVKAVVTPLPRNRVDLKLVFQEGVSAEIQQINIVGNHAFTTDELISHFQLRDEVPWWNVVGDRKYQKQKLAGDLETLRSYYLDRGYARFNIDSTQVSLTPDKKGIYVTVNITEGDQYKLSGVEVSGNLAGHSAEIEQLTKIEPGELYNGTKVTKMEDDIKKLLGRYGYAYPRVQSMPEINDADKTVKLRVNVDAGNRFYVRKIRFEGNDTSKDAVLRREMRQMEGAWLGSDLVDQGKERLNRLGFFETVDTDTQRVPGSPDQVDVVYKVKERNTGSFNFGIGYGTESGVSFQAGVQQDNWLGTGYAVGINGTKNDYQTYAELSVTNPYFTVDGVSLGGRLFYNDFQADDADLSDYTNKSYGTDVTLGFPINEYNSLRAGLGYVHNSLSNMQPQVAMWRYLYSMGEHPSTSDQDNSFKTDDFTFNYGWTYNKLDRGYFPTDGSRVNLTGKVTIPGSDNEYYKVTLDTATYVPIDDDHKWVVLGRTRWGYGDGLGGKEMPFYENFYAGGSSTVRGFQSNTIGPKAVYFPHQASNYDPDYDYECATQDGAKDLCKSDDAVGGNAMAVASLEFITPTPFISDKYANSVRTSFFWDMGTVWDTNWDSSQYSGYPDYSDPSNIRMSAGIALQWMSPLGPLVFSYAQPFKKYDGDKAEQFQFNIGKTW": 124,
      "MANIKSAKKRAIQSEKARKHNASRRSMMRTFIKKVYAAIEAGDKAAAQKAFNEMQPIVDRQAAKGLIHKNKAARHKANLTAQINKLA": 125,
      "MDFNLNDEQELFVAGIRELMASENWEAYFAECDRDSVYPERFVKALADMGIDSLLIPEEHGGLDAGFVTLAAVWMELGRLGAPTYVLYQLPGGFNTFLREGTQEQIDKIMAFRGTGKQMWNSAITEPGAGSDVGSLKTTYTRRNGKIYLNGSKCFITSSAYTPYIVVMARDGASPDKPVYTEWFVDMSKPGIKVTKLEKLGLRMDSCCEITFDDVELDEKDMFGREGNGFNRVKEEFDHERFLVALTNYGTAMCAFEDAARYANQRVQFGEAIGRFQLIQEKFAHMAIKLNSMKNMLYEAAWKADNGTITSGDAAMCKYFCANAAFEVVDSAMQVLGGVGIAGNHRISRFWRDLRVDRVSGGSDEMQILTLGRAVLKQYR": 126,
      "MEKYCELIRKRYAEIASGDLGYVPDALGCVLKVLNEMAADDALSEAVREKAAYAAANLLVSDYVNE": 127,
      "MIKQRTLKRIVQATGVGLHTGKKVTLTLRPAPANTGVIYRRTDLNPPVDFPADAKSVRDTMLCTCLVNEHDVRISTVEHLNAALAGLGIDNIVIEVNAPEIPIMDGSAAPFVYLLLDAGIDELNCAKKFVRIKETVRVEDGDKWAEFKPYNGFSLDFTIDFNHPAIDSSNQRYAMNFSADAFMRQISRARTFGFMRDIEYLQSRGLCLGGSFDCAIVVDDYRVLNEDGLRFEDEFVRHKMLDAIGDLFMCGHNIIGAFTAYKSGHALNNKLLQAVLAKQEAWEYVTFQDDAELPLAFKAPSAVLA": 128,
      "MKIVEVKHPLVKHKLGLMREQDISTKRFRELASEVGSLLTYEATADLETEKVTIEGWNGPVEIDQIKGKKITVVPILRAGLGMMDGVLENVPSARISVVGMYRNEETLEPVPYFQKLVSNIDERMALIVDPMLATGGSVIATIDLLKKAGCSSIKVLVLVAAPEGIAALEKAHPDVELYTASIDQGLNEHGYIIPGLGDAGDKIFGTK": 129,
      "MKRPDYRTLQALDAVIRERGFERAAQKLCITQSAVSQRIKQLENMFGQPLLVRTVPPRPTEQGQKLLALLRQVELLEEEWLGDEQTGSTPLLLSLAVNADSLATWLLPALAPVLADSPIRLNLQVEDETRTQERLRRGEVVGAVSIQHQALPSCLVDKLGALDYLFVSSKPFAEKYFPNGVTRSALLKAPVVAFDHLDDMHQAFLQQNFDLPPGSVPCHIVNSSEAFVQLARQGTTCCMIPHLQIEKELASGELIDLTPGLFQRRMLYWHRFAPESRMMRKVTDALLDYGHKVLRQD": 130,
      "MNIRRKNRLWIACAVLAGLALTIGLVLYALRSNIDLFYTPGEILYGKRETQQMPEVGQRLRVGGMVMPGSVQRDPNSLKVTFTIYDAEGSVDVSYEGILPDLFREGQGVVVQGELEKGNHILAKEVLAKHDENYTPPEVEKAMEANHRRPASVYKDPAS": 131,
      "MPKSVIIPAGSSAPLAPFVPGTLADGVVYVSGTLAFDQHNNVLFADDPKAQTRHVLETIRKVIETAGGTMADVTFNSIFITDWKNYAAINEIYAEFFPGDKPARFCIQCGLVKPDALVEIATIAHIAK": 132,
      "MPRANEIKKGMVLNYNGKLLLVKDIDIQSPTARGAATLYKMRFSDVRTGLKVEERFKGDDIVDTVTLTRRYVDFSYVDGNEYVFMDKEDYTPYTFTKDQIEEELLFMPEGGMPDMQVLTWDGQLLALELPQTVDLEIVETAPGIKGASASARNKPATLSTGLVIQVPEYLSPGEKIRIHIEERRYMGRAD": 133,
      "MQFSTTPTLEGQTIVEYCGVVTGEAILGANIFRDFFAGIRDIVGGRSGAYEKELRKAREIAFEELGSQARALGADAVVGIDIDYETVGQNGSMLMVSVSGTAVKTRR": 134,
      "MQNQRIRIRLKAFDHRLIDQATAEIVETAKRTGAQVRGPIPLPTRKERFTVLISPHVNKDARDQYEIRTHLRLVDIVEPTEKTVDALMRLDLAAGVDVQISLG": 135,
      "MQRVTITLDDDLLETLDSLSQRRGYNNRSEAIRDILRSALAQEATQQHGTQGFAVLSYVYEHEKRDLASRIVSTQHHHHDLSVATLHVHINHDDCLEIAVLKGDMGDVQHFADDVIAQRGVRHGHLQCLPKED": 136,
      "MRHYEIVFMVHPDQSEQVPGMIERYTAAITGAEGKIHRLEDWGRRQLAYPINKLHKAHYVLMNVEAPQEVIDELETTFRFNDAVIRSMVMRTKHAVTEASPMVKAKDERRERRDDFANETADDAEAGDSEE": 137,
      "MSAIAPGMILIAYLCGSISSAILVCRLCGLPDPRTSGSGNPGATNVLRIGGKGAAVAVLIFDVLKGMLPVWGAYELGVSPFWLGLIAIAACLGHIWPVFFGFKGGKGVATAFGAIAPIGWDLTGVMAGTWLLTVLLSGYSSLGAIVSALIAPFYVWWFKPQFTFPVSMLSCLILLRHHDNIQRLWRRQETKIWTKFKRKREKDPE": 138,
      "MSKIVKIIGREIIDSRGNPTVEAEVHLEGGFVGMAAAPSGASTGSREALELRDGDKSRFLGKGVTKAVAAVNGPIAQALIGKDAKDQAGIDKIMIDLDGTENKSKFGANAILAVSLANAKAAAAAKGMPLYEHIAELNGTPGKYSMPVPMMNIINGGEHADNNVDIQEFMIQPVGAKTVKEAIRMGSEVFHHLAKVLKAKGMNTAVGDEGGYAPNLGSNAEALAVIAEAVKAAGYELGKDITLAMDCAASEFYKDGKYVLAGEGNKAFTSEEFTHFLEELTKQYPIVSIEDGLDESDWDGFAYQTKVLGDKIQLVGDDLFVTNTKILKEGIEKGIANSILIKFNQIGSLTETLAAIKMAKDAGYTAVISHRSGETEDATIADLAVGTAAGQIKTGSMSRSDRVAKYNQLIRIEEALGEKAPYNGRKEIKGQA": 139,
      "MSLSTEATAKIVSEFGRDANDTGSTEVQVALLTAQINHLQGHFAEHKKDHHSRRGLLRMVSQRRKLLDYLKRKDVARYTQLIERLGLRR": 140,
      "MTAIAPVITIDGPSGAGKGTLCKAMAEALQWHLLDSGAIYRVLALAALHHHVDVASEDALVPLASHLDVRFVSTNGNLEVILEGEDVSGEIRTQEVANAASQVAAFPRVREALLRRQRAFRELPGLIADGRDMGTVVFPDAPVKIFLDASSEERAHRRMLQLQEKGFSVNFERLLAEIKERDDRDRNRAVAPLVPAADALVLDSTTLSIEQVIEKALQYARQKLALA": 141,
      "MTDKRKDGSGKLLYCSFCGKSQHEVRKLIAGPSVYICDECVDLCNDIIREEIKEVAPHRERSALPTPHEIRNHLDDYVIGQEQAKKVLAVAVYNHYKRLRNGDTSNGVELGKSNILLIGPTGSGKTLLAETLARLLDVPFTMADATTLTEAGYVGEDVENIIQKLLQKCDYDVQKAQRGIVYIDEIDKISRKSDNPSITRDVSGEGVQQALLKLIEGTVAAVPPQGGRKHPQQEFLQVDTSKILFICGGAFAGLDKVISHRVETGSGIGFGATVKAKSDKASEGELLAQVEPEDLIKFGLIPEFIGRLPVVATLNELSEEALIQILKEPKNALTKQYQALFNLEGVDLEFRDEALDAIAKKAMARKTGARGLRSIVEAALLDTMYDLPSMEDVEKVVIDESVIDGQSKPLLIYGKPEAQQASGE": 142,
      "MTKSELIERLATQQSHIPAKTVEDAVKEMLEHMASTLAQGERIEIRGFGSFSLHYRAPRTGRNPKTGDKVELEGKYVPHFKPGKELRDRANIYG": 143,
      "MTSSYLHFPEFDPVIFSIGPVALHWYGLMYLVGFIFAMWLATRRANRPGSGWTKNEVENLLYAGFLGVFLGGRIGYVLFYNFPQFMADPLYLFRVWDGGMSFHGGLIGVIVVMIIFARRTKRSFFQVSDFIAPLIPFGLGAGRLGNFINGELWGRVDPNFPFAMLFPGSRTEDILLLQTNPQWQSIFDTYGVLPRHPSQLYELLLEGVVLFIILNLYIRKPRPMGAVSGLFLIGYGAFRIIVEFFRQPDAQFTGAWVQYISMGQILSIPMIVAGVIMMVWAYRRSPQQHVS": 144,
      "MTTKRKPYVRPMTSTWWKKLPFYRFYMLREGTAVPAVWFSIELIFGLFALKNGPEAWAGFVDFLQNPVIVIINLITLAAALLHTKTWFELAPKAANIIVKDEKMGPEPIIKSLWAVTVVATIVILFVALYW": 145,
      "MTTNYIFVTGGVVSSLGKGIAAASLAAILEARGLNVTIMKLDPYINVDPGTMSPIQHGEVFVTEDGAETDLDLGHYERFIRTKMSRRNNFTTGRIYSDVLRKERRGDYLGATVQVIPHITNAIKERVLEGGEGHDVVLVEIGGTVGDIESLPFLEAIRQMAVEIGREHTLFMHLTLVPYMAASGEVKTKPTQHSVKELLSIGIQPDILICRSDRAVPANERAKIALFCNVPEKAVISLKDVDSIYKIPGLLKSQGLDDYICKRFSLNCPEANLSEWEQVIFEEANPVSEVTIGMVGKYIELPDAYKSVIEALKHGGLKNRVSVNIKLIDSQDVETRGVEILKGLDAILVPGGFGYRGVEGMITTARFARENNIPYLGICLGMQVALIDYARHVANMENANSTEFVPDCKYPVVALITEWRDENGNVEVRSEKSDLGGTMRLGAQQCQLVDDSLVRQLYNAPTIVERHRHRYEVNNMLLKQIEDAGLRVAGRSGDDQLVEIIEVPNHPWFVACQFHPEFTSTPRDGHPLFAGFVKAASEFQKRQAK": 146,
      "MVYSYTEKKRIRKDFGKRPQVLDVPYLLSIQLDSFQKFIEQDPEGQYGLEAAFRSVFPIQSYSGNSELQYVSYRLGEPVFDVQECQIRGVTYSAPLRVKLRLVIYEREAPEGTVKDIKEQEVYMGEIPLMTDNGTFVINGTERVIVSQLHRSPGVFFDSDKGKTHSSGKVLYNARIIPYRGSWLDFEFDPKDNLFVRIDRRRKLPATIILRALNYTTEQILDLFFEKVIFEIRDNKLQMELVPERLRGETASFDIEANGKVYVEKGRRITARHIRQLEKDDVKLIEVPVEYIAGKVVAKDYIDESTGELICAANMELSLDLLAKLSQSGHKRIETLFTNDLDHGPYISETLRVDPTNDRLSALVEIYRMMRPGEPPTREAAESLFENLFFSEDRYDLSAVGRMKFNRSLLREEIEGSGILSKDDIIDVMKKLIDIRNGKGEVDDIDHLGNRRIRSVGEMAENQFRVGLVRVERAVKERLSLGDLDTLMPQDMINAKPISAAVKEFFGSSQLSQFMDQNNPLSEITHKRRISALGPGGLTRERAGFEVRDVHPTHYGRVCPIETPEGPNIGLINSLSVYAQTNEYGFLETPYRKVTDGVVTDEIHYLSAIEEGNYVIAQANSNLDEEGHFVEDLVTCRSKGESSLFSRDQVDYMDVSTQQVVSVGASLIPFLEHDDANRALMGANMQRQAVPTLRADKPLVGTGMERAVAVDSGVTAVAKRGGVVQYVDASRIVIKVNEDEMYPGEAGIDIYNLTKYTRSNQNTCINQMPCVSLGEPVERGDVLADGPSTDLGELALGQNMRVAFMPWNGYNFEDSILVSERVVQEDRFTTIHIQELACVSRDTKLGPEEITADIPNVGEAALSKLDESGIVYIGAEVTGGDILVGKVTPKGETQLTPEEKLLRAIFGEKASDVKDSSLRVPNGVSGTVIDVQVFTRDGVEKDKRALEIEEMQLKQAKKDLSEELQILEAGLFSRIRAVLVAGGVEAEKLDKLPRDRWLELGLTDEEKQNQLEQLAEQYDELKHEFEKKLEAKRRKITQGDDLAPGVLKIVKVYLAVKRRIQPGDKMAGRHGNKGVISKINPIEDMPYDENGTPVDIVLNPLGVPSRMNIGQILETHLGMAAKGIGDKINAMLKQQQEVAKLREFIQRAYDLGADVRQKVDLSTFSDEEVMRLAENLRKGMPIATPVFDGAKEAEIKELLKLGDLPTSGQIRLYDGRTGEQFERPVTVGYMYMLKLNHLVDDKMHARSTGSYSLVTQQPLGGKAQFGGQRFGEMEVWALEAYGAAYTLQEMLTVKSDDVNGRTKMYKNIVDGNHQMEPGMPESFNVLLKEIRSLGINIELEDE": 147,
      "MYAVFQSGGKQHRVSEGQTVRLEKLDIATGETVEFAEVLMIANGEEVKIGVPFVDGGVIKAEVVAHGRGEKVKIVKFRRRKHYRKQQGHRQWFTDVKITGISA": 148,
      "MYIYWILLGLAIATEITGTLSMKWASVSEGNGGFILMLVMISLSYIFLSFAVKKIALGVAYALWEGIGILFITLFSVLLFDESLSLMKIAGLTTLVAGIVLIKSGTRKARKPELEVNHGAV": 149,
      "MAGAKEIRSKIASVQNTQKITKAMEMVAASKMRKSQDRMAASRPYAETMRKVIGHLAHGNLEYKHPYLEDRDVKRVGYLVVSTDRGLCGGLNINLFKKLLAEMKTWTDKGVQCDLAMIGSKGVSFFNSVGGNVVAQVTGMGDNPSLSELIGPVKVMLQAYDEGRLDKLYIVSNKFINTMSQVPTISQLLPLPASDDDDLKHKSWDYLYEPDPKALLDTLLRRYVESQVYQGVVENLASEQAARMVAMKAATDNGGSLIKELQLVYNKARQASITQELTEIVSGAAAV": 150,
      "MAIILGIDPGSRVTGYGVIRQVGRQLSYLGSGCIRTKVDDLPSRLKLIYAGVTEIITQFQPDYFAIEQVFMAKNADSALKLGQARGVAIVAAVNQELPVFEYAARQVKQTVVGIGSAEKSQVQHMVRTLLKLPANPQADAADALAIAITHCHVSQNAMQMSESRLNLARGRLR": 151,
      "MAKGQSLQDPFLNALRRERVPVSIYLVNGIKLQGQIESFDQFVILLKNTVSQMVYKHAISTVVPSRPVSHHSNNAGGGTSSNYHHGSSAQNTSAQQDSEETE": 152,
      "MAKLTKRMRVIREKVDATKQYDINEAIALLKELATAKFVESVDVAVNLGIDARKSDQNVRGATVLPHGTGRSVRVAVFTQGANAEAAKAAGAELVGMEDLADQIKKGEMNFDVVIASPDAMRVVGQLGQVLGPRGLMPNPKVGTVTPNVAEAVKNAKAGQVRYRNDKNGIIHTTIGKVDFDADKLKENLEALLVALKKAKPTQAKGVYIKKVSISTTMGAGVAVDQAGLSASVN": 153,
      "MAPPLSPGSRVLIALIRVYQRLISPLLGPHCRFTPTCSSYGIEALRRFGVIKGSWLTVKRVLKCHPLHPGGDDPVPPGPFDTREH": 154,
      "MDNAVDRHVFYISDGTAITAEVLGHAVMSQFPVTISSITLPFVENESRARAVKDQIDAIYHQTGVRPLVFYSIVLPEIRAIILQSEGFCQDIVQALVAPLQQEMKLDPTPIAHRTHGLNPNNLNKYDARIAAIDYTLAHDDGISLRNLDQAQVILLGVSRCGKTPTSLYLAMQFGIRAANYPFIADDMDNLVLPASLKPLQHKLFGLTIDPERLAAIREERRENSRYASLRQCRMEVAEVEALYRKNQIPWINSTNYSVEEIATKILDIMGLSRRMY": 155,
      "MEFSVKSGSPEKQRSACIVVGVFEPRRLSPIAEQLDKISDGYISALLRRGELEGKPGQTLLLHHVPNVLSERILLIGCGKERELDERQYKQVIQKTINTLNDTGSMEAVCFLTELHVKGRNNYWKVRQAVETAKETLYSFDQLKTNKSEPRRPLRKMVFNVPTRRELTSGERAIQHGLAIAAGIKAAKDLGNMPPNICNAAYLASQARQLADSYSKNVITRVIGEQQMKELGMHSYLAVGQGSQNESLMSVIEYKGNASEDARPIVLVGKGLTFDSGGISIKPSEGMDEMKYDMCGAAAVYGVMRMVAELQLPINVIGVLAGCENMPGGRAYRPGDVLTTMSGQTVEVLNTDAEGRLVLCDVLTYVERFEPEAVIDVATLTGACVIALGHHITGLMANHNPLAHELIAASEQSGDRAWRLPLGDEYQEQLESNFADMANIGGRPGGAITAGCFLSRFTRKYNWAHLDIAGTAWRSGKAKGATGRPVALLAQFLLNRAGFNGEE": 156,
      "MIDDDGYRPNVGIVICNRQGQVMWARRFGQHSWQFPQGGINPGESAEQAMYRELFEEVGLSRKDVRILASTRNWLRYKLPKRLVRWDTKPVCIGQKQKWFLLQLVSGDAEINMQTSSTPEFDGWRWVSYWYPVRQVVSFKRDVYRRVMKEFASVVMSLQENTPKPQNASAYRRKRG": 157,
      "MIKKIGVLTSGGDAPGMNAAIRGVVRSALTEGLEVMGIYDGYLGLYEDRMVQLDRYSVSDMINRGGTFLGSARFPEFRDENIRAVAIENLKKRGIDALVVIGGDGSYMGAMRLTEMGFPCIGLPGTIDNDIKGTDYTIGFFTALSTVVEAIDRLRDTSSSHQRISVVEVMGRYCGDLTLAAAIAGGCEFVVVPEVEFSREDLVNEIKAGIAKGKKHAIVAITEHMCDVDELAHFIEKETGRETRATVLGHIQRGGSPVPYDRILASRMGAYAIDLLLAGYGGRCVGIQNEQLVHHDIIDAIENMKRPFKGDWLDCAKKLY": 158,
      "MINSPRVCIQVQSVYIEAQSSPDNERYVFAYTVTIRNLGRAPVQLLGRYWLITNGNGRETEVQGEGVVGVQPLIAPGEEYQYTSGAIIETPLGTMQGHYEMIDENGVPFSIDIPVFRLAVPTLIH": 159,
      "MKQKVVSIGDINVANDLPFVLFGGMNVLESRDLAMRICEHYVTVTQKLGIPYVFKASFDKANRSSIHSYRGPGLEEGMKIFQELKQTFGVKIITDVHEPSQAQPVADVVDVIQLPAFLARQTDLVEAMAKTGAVINVKKPQFVSPGQMGNIVDKFKEGGNEKVILCDRGANFGYDNLVVDMLGFSIMKKVSGNSPVIFDVTHALQCRDPFGAASGGRRAQVAELARAGMAVGLAGLFIEAHPDPEHAKCDGPSALPLAKLEPFLKQMKAIDDLVKGFEELDTSK": 160,
      "MKTGIVTTLIALCLPVSVFATTLRLSTDVDLLVLDGKKVSSSLLRGADSIELDNGPHQLVFRVEKTIHLSNSEERLYISPPLVVSFNTQLINQVNFRLPRLENEREANHFDAAPRLELLDGDATPIPVKLDILAITSTAKTIDYEVEVERYNKSAKRASLPQFATMMADDSTLLSGVSELDAIPPQSQVLTEQRLKYWFKLADPQTRNTFLQWAEKQPSS": 161,
      "MMRIALFLLTNLAVMVVFGLVLSLTGIQSSSVQGLMIMALLFGFGGSFVSLLMSKWMALRSVGGEVIEQPRNERERWLVNTVATQARQAGIAMPQVAIYHAPDINAFATGARRDASLVAVSTGLLQNMSPDEAEAVIAHEISHIANGDMVTMTLIQGVVNTFVIFISRILAQLAAGFMGGNRDEGEESNGNPLIYFAVATVLELVFGILASIITMWFSRHREFHADAGSAKLVGREKMIAALQRLKTSYEPQEATSMMAFCINGKSKSLSELFMTHPPLDKRIEALRTGEYLK": 162,
      "MNQRNASMTVIGAGSYGTALAITLARNGHEVVLWGHDPEHIATLERDRCNAAFLPDVPFPDTLHLESDLATALAASRNILVVVPSHVFGEVLRQIKPLMRPDARLVWATKGLEAETGRLLQDVAREALGDQIPLAVISGPTFAKELAAGLPTAISLASTDQTFADDLQQLLHCGKSFRVYSNPDFIGVQLGGAVKNVIAIGAGMSDGIGFGANARTALITRGLAEMSRLGAALGADPATFMGMAGLGDLVLTCTDNQSRNRRFGMMLGQGMDVQSAQEKIGQVVEGYRNTKEVRELAHRFGVEMPITEEIYQVLYCGKNAREAALTLLGRARKDERSSH": 163,
      "MPSFDIVSEVDLQEARNAVDNASREVESRFDFRNVEASFELNDASKTIKVLSESDFQVNQLLDILRAKLLKRGIEGSSLDVPENIVHSGKTWFVEAKLKQGIESATQKKIVKMIKDSKLKVQAQIQGDEIRVTGKSRDDLQAVMAMVRGGDLGQPFQFKNFRD": 164,
      "MQTSPLLTQLMEALRCLPGVGPKSAQRMAFTLLQRDRSGGMRLAQALTRAMSEIGHCADCRTFTEQEVCNICSNPRRQENGQICVVESPADIYAIEQTGQFSGRYFVLMGHLSPLDGIGPDDIGLDRLEQRLAEEKITEVILATNPTVEGEATANYIAELCAQYDVEASRIAHGVPVGGELEMVDGTTLSHSLAGRHKIRF": 165,
      "MRHPLVMGNWKLNGSRHMVHELVSNLRKELAGVAGCAVAIAPPEMYIDMAKREAEGSHIMLGAQNVDLNLSGAFTGETSAAMLKDIGAQYIIIGHSERRTYHKESDELIAKKFAVLKEQGLTPVLCIGETEAENEAGKTEEVCARQIDAVLKTQGAAAFEGAVIAYEPVWAIGTGKSATPAQAQAVHKFIRDHIAKVDANIAEQVIIQYGGSVNASNAAELFAQPDIDGALVGGASLKADAFAVIVKAAEAAKQA": 166,
      "MSEFITVARPYAKAAFDFAVEHQSVERWQDMLAFAAEVTKNEQMAELLSGALAPETLAESFIAVCGEQLDENGQNLIRVMAENGRLNALPDVLEQFIHLRAVSEATAEVDVISAAALSEQQLAKISAAMEKRLSRKVKLNCKIDKSVMAGVIIRAGDMVIDGSVRGRLERLADVLQS": 167,
      "MSETASWQPSASIPNLLKRAAIMAEIRRFFADRGVLEVETPCMSQATVTDIHLVPFETRFVGPGHSQGMNLWLMTSPEYHMKRLLVAGCGPVFQLCRSFRNEEMGRYHNPEFTMLEWYRPHYDMYRLMNEVDDLLQQVLDCPAAESLSYQQAFLRYLEIDPLSADKTQLREVAAKLDLSNVADTEEDRDTLLQLLFTFGVEPNIGKEKPTFVYHFPASQASLAQISTEDHRVAERFEVYYKGIELANGFHELTDAREQQQRFEQDNRKRAARGLPQHPIDQNLIEALKVGMPDCSGVALGVDRLVMLALGAETLAEVIAFSVDRA": 168,
      "MSITKDQIIEAVAAMSVMDVVELISAMEEKFGVSAAAAVAVAAGPVEAAEEKTEFDVILKAAGANKVAVIKAVRGATGLGLKEAKDLVESAPAALKEGVSKDDAEALKKALEEAGAEVEVK": 169,
      "MSTAKLVKSKATNLLYTRNDVSDSEKKATVELLNRQVIQFIDLSLITKQAHWNMRGANFIAVHEMLDGFRTALIDHLDTMAERAVQLGGVALGTTQVINSKTPLKSYPLDIHNVQDHLKELADRYAIVANDVRKAIGEAKDDDTADILTAASRDLDKFLWFIESNIE": 170,
      "MTDLFSSPDHTLDALGLRCPEPVMMVRKTVRNMQPGETLLIIADDPATTRDIPGFCTFMEHELVAKETDGLPYRYLIRKGG": 171,
      "MTHDNKLQVEAIKRGTVIDHIPAQIGFKLLSLFKLTETDQRITIGLNLPSGEMGRKDLIKIENTFLSEDQVDQLALYAPQATVNRIDNYEVVGKSRPSLPERIDNVLVCPNSNCISHAEPVSSSFAVRKRANDIALKCKYCEKEFSHNVVLAN": 172,
      "MTMSLEVFEKLEAKVQQAIDTITLLQMEIEELKEKNNSLSQEVQNAQHQREELERENNHLKEQQNGWQERLQALLGRMEEV": 173,
      "MTQDELKKAVGWAALQYVQPGTIVGVGTGSTAAHFIDALGTMKGQIEGAVSSSDASTEKLKSLGIHVFDLNEVDSLGIYVDGADEINGHMQMIKGGGAALTREKIIASVAEKFICIADASKQVDILGKFPLPVEVIPMARSAVARQLVKLGGRPEYRQGVVTDNGNVILDVHGMEILDPIAMENAINAIPGVVTVGLFANRGADVALIGTPDGVKTIVK": 174,
      "MTTIVSVRRNGHVVIAGDGQATLGNTVMKGNVKKVRRLYNDKVIAGFAGGTADAFTLFELFERKLEMHQGHLVKAAVELAKDWRTDRMLRKLEALLAVADETASLIITGNGDVVQPENDLIAIGSGGPYAQAAARALLENTELSAREIAEKALDIAGDICIYTNHFHTIEELSYKA": 175,
      "MTTNTHTLQIEEILELLPHRFPFLLVDRVLDFEEGRFLRAVKNVSVNEPFFQGHFPGKPIFPGVLILEAMAQATGILAFKSVGKLEPGELYYFAGIDEARFKRPVVPGDQMIMEVTFEKTRRGLTRFKGVALVDGKVVCEATMMCARSREA": 176,
      "MWIGIISLFPEMFRAITDYGVTGRAVKNGLLSIQSWSPRDFTHDRHRTVDDRPYGGGPGMLMMVQPLRDAIHAAKAAAGEGAKVIYLSPQGRKLDQAGVSELATNQKLILVCGRYEGIDERVIQTEIDEEWSIGDYVLSGGELPAMTLIDSVSRFIPGVLGHEASATEDSFAEGLLDCPHYTRPEVLEGMEVPPVLLSGNHAEIRRWRLKQSLGRTWLRRPELLENLALTEEQARLLAEFKTEHAQQQHKHDGMA": 177,
      "MAQFEWVHAAWLALAIVLEIVANVFLKFSDGFRRKIFGLLSLAAVLAAFSALSQAVKGIDLSVAYALWGGFGIAATLAAGWILFGQRLNRKGWIGLVLLLAGMIMVKLA": 178,
      "MEAIKGSDVNVPDAVFAWMLDGRGGVKPLENTDVIDEAHPCWLHLNYVHHDSAQWLATTPLLPNNVRDALAGESTRPRVSRLGEGTLITLRCINGSTDERPDQLVAMRVYMDGRLIVSTRQRKVLALDDVVSDLEEGTGPTDCGGWLVDVCDALTDHSSEFIEQLHDKIIDLEDNLLDQQIPPRGFLALLRKQLIVMRRYMAPQRDVYARLASERLPWMSDDQRRRMQDIADRLGRGLDEIDACIARTGVMADEIAQVMQENLARRTYTMSLMAMVFLPSTFLTGLFGVNLGGIPGGGWQFGFSIFCILLVVLIGGVALWLHRSKWL": 179,
      "MERFLENAMYASRWLLAPVYFGLSLALVALALKFFQEIIHVLPNIFSMAESDLILVLLSLVDMTLVGGLLVMVMFSGYENFVSQLDISENKEKLNWLGKMDATSLKNKVAASIVAISSIHLLRVFMDAKNVPDNKLMWYVIIHLTFVLSAFVMGYLDRLTRHNH": 180,
      "MFAGLPSLTHEQQQKAVERIQELMAQGMSSGQAIALVAEELRANHSGERIVARFEDEDE": 181,
      "MGNNVVVLGTQWGDEGKGKIVDLLTERAKYVVRYQGGHNAGHTLVINGEKTVLHLIPSGILRENVTSIIGNGVVLSPAALMKEMKELEDRGIPVRERLLLSEACPLILDYHVALDNAREKARGAKAIGTTGRGIGPAYEDKVARRGLRVGDLFDKETFAEKLKEVMEYHNFQLVNYYKAEAVDYQKVLDDTMAVADILTSMVVDVSDLLDQARQRGDFVMFEGAQGTLLDIDHGTYPYVTSSNTTAGGVATGSGLGPRYVDYVLGILKAYSTRVGAGPFPTELFDETGEFLCKQGNEFGATTGRRRRTGWLDTVAVRRAVQLNSLSGFCLTKLDVLDGLKEVKLCVAYRMPDGREVTTTPLAADDWKGVEPIYETMPGWSESTFGVKDRSGLPQAALNYIKRIEELTGVPIDIISTGPDRTETMILRDPFDA": 182,
      "MIASKFGIGQQVRHSLLGYLGVVVDIDPVYSLSEPSPDELAVNDELRAAPWYHVVMEDDNGLPVHTYLAEAQLSSELQDEHPEQPSMDELAQTIRKQLQAPRLRN": 183,
      "MIDKSAFVHPTAIVEEGASIGANAHIGPFCIVGPHVEIGEGTVLKSHVVVNGHTKIGRDNEIYQFASIGEVNQDLKYAGEPTRVEIGDRNRIRESVTIHRGTVQGGGLTKVGSDNLLMINAHIAHDCTVGNRCILANNATLAGHVSVDDFAIIGGMTAVHQFCIIGAHVMVGGCSGVAQDVPPYVIAQGNHATPFGVNIEGLKRRGFSREAITAIRNAYKLIYRSGKTLDEVKPEIAELAETYPEVKAFTDFFARSTRGLIR": 184,
      "MIGRLRGIIIEKQPPLVLIEVGGVGYEVHMPMTCFYELPEAGQEAIVFTHFVVREDAQLLYGFNNKQERTLFKELIKTNGVGPKLALAILSGMSAQQFVNAVEREEVGALVKLPGIGKKTAERLIVEMKDRFKGLHGDLFTPAADLVLTSPASPATDDAEQEAVAALVALGYKPQEASRMVSKIARPDASSETLIREALRAAL": 185,
      "MKFELDTTDGRARRGRLVFDRGVVETPCFMPVGTYGTVKGMTPEEVEATGAQIILGNTFHLWLRPGQEIMKLHGDLHDFMQWKGPILTDSGGFQVFSLGDIRKITEQGVHFRNPINGDPIFLDPEKSMEIQYDLGSDIVMIFDECTPYPADWDYAKRSMEMSLRWAKRSRERFDSLGNKNALFGIIQGSVYEDLRDISVKGLVDIGFDGYAVGGLAVGEPKADMHRILEHVCPQIPADKPRYLMGVGKPEDLVEGVRRGIDMFDCVMPTRNARNGHLFVTDGVVKIRNAKYKSDTGPLDPECDCYTCRNYSRAYLHHLDRCNEILGARLNTIHNLRYYQRLMAGLRKAIEEGKLESFVTDFYQRQGREVPPLNVD": 186,
      "MKPSIVAKLEALHERHEEVQALLGDAQTIADQERFRALSREYAQLSDVSRCFTDWQQVQEDIETAQMMLDDPEMREMAQDELREAKEKSEQLEQQLQVLLLPKDPDDERNAFLEVRAGTGGDEAALFAGDLFRMYSRYAEARRWRVEIMSASEGEHGGYKEIIAKISGDGVYGRLKFESGGHRVQRVPATESQGRIHTSACTVAVMPELPDAELPDINPADLRIDTFRSSGAGGQHVNTTDSAIRITHLPTGIVVECQDERSQHKNKAKALSVLGARIHAAEMAKRQQAEASTRRNLLGSGDRSDRNRTYNFPQGRVTDHRINLTLYRLDEVMEGKLDMLIEPIIQEHQADQLAALSEQE": 187,
      "MKRAFIMVLDSFGIGATEDAERFGDVGADTLGHIAEACAKGEADNGRKGPLNLPNLTRLGLAKAHEGSTGFIPAGMDGNAEVIGAYAWAHEMSSGKDTPSGHWEIAGVPVLFEWGYFSDHENSFPQELLDKLVERANLPGYLGNCHSSGTVILDQLGEEHMKTGKPIFYTSADSVFQIACHEETFGLDKLYELCEIAREELTNGGYNIGRVIARPFIGDKAGNFQRTGNRHDLAVEPPAPTVLQKLVDEKHGQVVSVGKIADIYANCGITKKVKATGLDALFDATIKEMKEAGDNTIVFTNFVDFDSSWGHRRDVAGYAAGLELFDRRLPELMSLLRDDDILILTADHGCDPTWTGTDHTREHIPVLVYGPKVKPGSLGHRETFADIGQTLAKYFGTSDMEYGKAMF": 188,
      "MKRISTTITTTITITTGNGAG": 189,
      "MKVMASVKRICRNCKIIKRKGVVRVICSSDPRHKQRQG": 190,
      "MKVRPSVKPICEYCKVIRRNGRVMVICPTNPKHKQRQG": 191,
      "MLKREMNIADYDAELWQAMEQEKVRQEEHIELIASENYTSPRVMQAQGSQLTNKYAEGYPGKRYYGGCEYVDIVEQLAIDRAKELFGADYANVQPHSGSQANFAVYTALLEPGDTVLGMNLAHGGHLTHGSPVNFSGKLYNIVPYGIDATGHIDYADLEKQAKEHKPKMIIGGFSAYSGVVDWAKMREIADSIGAYLFVDMAHVAGLVAAGVYPNPVPHAHVVTTTTHKTLAGPRGGLILAKGGSEELYKKLNSAVFPGGQGGPLMHVIAGKAVALKEAMEPEFKTYQQQVAKNAKAMVEVFLERGYKVVSGGTDNHLFLVDLVDKNLTGKEADAALGRANITVNKNSVPNDPKSPFVTSGIRVGTPAITRRGFKEAEAKELAGWMCDVLDSINDEAVIERIKGKVLDICARYPVYA": 192,
      "MLQSNEYFSGKVKSIGFSSSSTGRASVGVMVEGEYTFSTAEPEEMTVISGALNVLLPDATDWQVYEAGSVFNVPGHSEFHLQVAEPTSYLCRYL": 193,
      "MMENYKHTTVLLDEAVNGLNIRPDGIYIDGTFGRGGHSRLILSQLGEEGRLLAIDRDPQAIAVAKTIDDPRFSIIHGPFSALGEYVAERDLIGKIDGILLDLGVSSPQLDDAERGFSFMRDGPLDMRMDPTRGQSAAEWLQTAEEADIAWVLKTYGEERFAKRIARAIVERNREQPMTRTKELAEVVAAATPVKDKFKHPATRTFQAVRIWVNSELEEIEQALKSSLNVLAPGGRLSIISFHSLEDRIVKRFMRENSRGPQVPAGLPMTEEQLKKLGGRQLRALGKLMPGEEEVAENPRARSSVLRIAERTNA": 194,
      "MPKKNEAPASFEKALSELEQIVTRLESGDLPLEEALNEFERGVQLARQGQAKLQQAEQRVQILLSDNEDASLTPFTPDNE": 195,
      "MPWIQLKLNTTGANAEDLSDALMEAGAVSITFQDTHDTPVFEPLPGETRLWGDTDVIGLFDAETDMNDVVAILENHPLLGAGFAHKIEQLEDKDWEREWMDNFHPMRFGERLWICPSWRDVPDENAVNVMLDPGLAFGTGTHPTTSLCLQWLDSLDLTGKTVIDFGCGSGILAIAALKLGAAKAIGIDIDPQAIQASRDNAERNGVSDRLELYLPKDQPEEMKADVVVANILAGPLRELAPLISVLPVSGGLLGLSGILASQAESVCEAYADSFALDPVVEKEEWCRITGRKN": 196,
      "MQKQAELYRGKAKTVYSTENPDLLVLEFRNDTSAGDGARIEQFDRKGMVNNKFNYFIMSKLAEAGIPTQMERLLSDTECLVKKLDMVPVECVVRNRAAGSLVKRLGIEEGIELNPPLFDLFLKNDAMHDPMVNESYCETFGWVSKENLARMKELTYKANDVLKKLFDDAGLILVDFKLEFGLYKGEVVLGDEFSPDGSRLWDKETLEKMDKDRFRQSLGGLIEAYEAVARRLGVQLD": 197,
      "MRLIPLTTAEQVGKWAARHIVNRINAFKPTADRPFVLGLPTGGTPMTTYKALVEMHKAGQVSFKHVVTFNMDEYVGLPKEHPESYYSFMHRNFFDHVDIPAENINLLNGNAPDIDAECRQYEEKIRSYGKIHLFMGGVGNDGHIAFNEPASSLASRTRIKTLTHDTRVANSRFFDNDVNQVPKYALTVGVGTLLDAEEVMILVLGSQKALALQAAVEGCVNHMWTISCLQLHPKAIMVCDEPSTMELKVKTLRYFNELEAENIKGL": 198,
      "MSGRGKGGKGLGKGGAKRHRKVLRDNIQGITKPAIRRLARRGGVKRISGLIYEETRGVLKVFLENVIRDAVTYTEHAKRKTVTAMDVVYALKRQGRTLYGFGG": 199,
      "MSKQLTAQAPVDPIVLGKMGSSYGIRGWLRVFSSTEDAESIFDYQPWFIQKAGQWQQVQLESWKHHNQDMIIKLKGVDDRDAANLLTNCEIVVDSSQLPQLEEGDYYWKDLMGCQVVTTEGYDLGKVVDMMETGSNDVLVIKANLKDAFGIKERLVPFLDGQVIKKVDLTTRSIEVDWDPGF": 200,
      "MTATAQQLEYLKNSIKSIQDYPKPGILFRDVTSLLEDPKAYALSIDLLVERYKNAGITKVVGTEARGFLFGAPVALGLGVGFVPVRKPGKLPRETISETYDLEYGTDQLEIHVDAIKPGDKVLVVDDLLATGGTIEATVKLIRRLGGEVADAAFIINLFDLGGEQRLEKQGITSYSLVPFPGH": 201,
      "MTKQPEDWLDDVPGDDIEDEDDEIIWVSKSEIKRDAEELKRLGAEIVDLGKNALDKIPLDADLRAAIELAQRIKMEGRRRQLQLIGKMLRQRDVEPIRQALDKLKNRHNQQVVLFHKLENLRDRLIDQGDDAIAEVLNLWPDADRQQLRTLIRNAKKEKEGNKPPKSARQIFQYLRELAENEG": 202,
      "MTNYRVESSSGRAARKMRLALMGPAFIAAIGYIDPGNFATNIQAGASFGYQLLWVVVWANLMAMLIQILSAKLGIATGKNLAEQIRDHYPRPVVWFYWVQAEIIAMATDLAEFIGAAIGFKLILGVSLLQGAVLTGIATFLILMLQRRGQKPLEKVIGGLLLFVAAAYIVELIFSQPNLAQLGKGMVIPSLPTSEAVFLAAGVLGATIMPHVIYLHSSLTQHLHGGSRQQRYSATKWDVAIAMTIAGFVNLAMMATAAAAFHFSGHTGVADLDEAYLTLQPLLSHAAATVFGLSLVAAGLSSTVVGTLAGQVVMQGFIRFHIPLWVRRTVTMLPSFIVILMGLDPTRILVMSQVLLSFGIALALVPLLIFTSDSKLMGDLVNSKRVKQTGWVIVVLVVALNIWLLVGTALGL": 203,
      "EQFDDYGHMRF": 204,
      "MELLLLSNSTLPGKAWLEHALPLIAEQLQGRRSAVFIPFAGVTQTWDDYTAKTAAVLAPLGVSVTGIHSVVDPVAAIENAEIVIVGGGNTFQLLKQCRERGLLAPITDVVKRGALYIGWSAGANLACPTIRTTNDMPIVDPQGFDALNLFPLQINPHFTNALPEGHKGETREQRIRELLVVAPELTIIGLPEGNWITVSKGHATLGGPNTTYVFKAGEEAVPLEAGHRF": 205,
      "MKLPIYLDYSATTPVDPRVAEKMMQFMTMDGTFGNPASRSHRFGWQAEEAVDIARNQIADLVGADPREIVFTSGATESDNLAIKGAANFYQKKGKHIITSKTEHKAVLDTCRQLEREGFEVTYLAPQRNGIIDLKELEAAMRDDTILVSIMHVNNEIGVVQDIAAIGEMCRARGIIYHVDATQSVGKLPIDLSQLKVDLMSFSGHKIYGPKGIGALYVRRKPRVRIEAQMHGGGHERGMRSGTLPVHQIVGMGEAYRIAKEEMATEMERLRGLRNRLWNGIKDIEEVYLNGDLEHGAPNILNVSFNYVEGESLIMALKDLAVSSGSACTSASLEPSYVLRALGLNDELAHSSIRFSLGRFTTEEEIDYTIELVRKSIGRLRDLSPLWEMYKQGVDLNSIEWAHH": 206,
      "MKVRASVKKLCRNCKIVKRDGVIRVICSAEPKHKQRQG": 207,
      "MLKQVEIFTDGSCLGNPGPGGYGAILRYRGREKTFSAGYTRTTNNRMELMAAIVALEALKEHCEVILSTDSQYVRQGITQWIHNWKKRGWKTADKKPVKNVDLWQRLDAALGQHQIKWEWVKGHAGHPENERCDELARAAAMNPTLEDTGYQVEV": 208,
      "MLKTIQDKARHRTRPLWAWLKLLWQRIDEDNMTTLAGNLAYVSLLSLVPLVAVVFALFAAFPMFSDVSIQLRHFIFANFLPATGDVIQRYIEQFVANSNKMTAVGACGLIVTALLLMYSIDSALNTIWRSKRARPKIYSFAVYWMILTLGPLLAGASLAISSYLLSLRWASDLNTVIDNVLRIFPLLLSWISFWLLYSIVPTIRVPNRDAIVGAFVAALLFEAGKKGFALYITMFPSYQLIYGVLAVIPILFVWVYWTWCIVLLGAEITVTLGEYRKLKQAAEQEEDDEP": 209,
      "MLVWLAEHLVKYYSGFNVFSYLTFRAIVSLLTALFISLWMGPRMIAHLQKLSFGQVVRNDGPESHFSKRGTPTMGGIMILTAIVISVLLWAYPSNPYVWCVLVVLVGYGVIGFVDDYRKVVRKDTKGLIARWKYFWMSVIALGVAFALYLAGKDTPATQLVVPFFKDVMPQLGLFYILLAYFVIVGTGNAVNLTDGLDGLAIMPTVFVAGGFALVAWATGNMNFASYLHIPYLRHAGELVIVCTAIVGAGLGFLWFNTYPAQVFMGDVGSLALGGALGIIAVLLRQEFLLVIMGGVFVVETLSVILQVGSFKLRGQRIFRMAPIHHHYELKGWPEPRVIVRFWIISLMLVLIGLATLKVR": 210,
      "MQLTSFTDYGLRALIYMASLPEGRMTSISEVTDVYGVSRNHMVKIINQLSRAGYVTAVRGKNGGIRLGKPASAIRIGDVVRELEPLSLVNCSSEFCHITPACRLKQALSKAVQSFLTELDNYTLADLVEENQPLYKLLLVE": 211,
      "MRLTSKGRYAVTAMLDVALNSEAGPVPLADISERQGISLSYLEQLFSRLRKNGLVSSVRGPGGGYLLGKDASSIAVGEVISAVDESVDATRCQGKGGCQGGDKCLTHALWRDLSDRLTGFLNNITLGELVNNQEVLDVSGRQHTHDAPRTRTQDAIDVKLRA": 212,
      "MSLFPVIVVFGLSFPPIFFELLLSLAIFWLVRRVLVPTGIYDFVWHPALFNTALYCCLFYLISRLFV": 213,
      "MSVLQVLHIPDERLRKVAKPVEEVNAEIQRIVDDMFETMYAEEGIGLAATQVDIHQRIIVIDVSENRDERLVLINPELLEKSGETGIEEGCLSIPEQRALVPRAEKVKIRALDRDGKPFELEADGLLAICIQHEMDHLVGKLFMDYLSPLKQQRIRQKVEKLDRLKARA": 214,
      "MTVRVAINGFGRIGRNVVRALYESGRRAEITVVAINELADAAGMAHLLKYDTSHGRFAWEVRQERDQLFVGDDAIRVLHERSLQSLPWRELGVDVVLDCTGVYGSREHGEAHIAAGAKKVLFSHPGSNDLDATVVYGVNQDQLRAEHRIVSNASCTTNCIIPVIKLLDDAYGIESGTVTTIHSAMHDQQVIDAYHPDLRRTRAASQSIIPVDTKLAAGITRFFPQFNDRFEAIAVRVPTINVTAIDLSVTVKKPVKANEVNLLLQKAAQGAFHGIVDYTELPLVSVDFNHDPHSAIVDGTQTRVSGAHLIKTLVWCDNEWGFANRMLDTTLAMATVAFR": 215,
      "MVDKSQETTHFGFQTVAKEQKADMVAHVFHSVASKYDVMNDLMSFGIHRLWKRFTIDCSGVRRGQTVLDLAGGTGDLTAKFSRLVGETGKVVLADINESMLKMGREKLRNIGVIGNVEYVQANAEALPFPDNTFDCITISFGLRNVTDKDKALRSMYRVLKPGGRLLVLEFSKPIIEPLSKAYDAYSFHVLPRIGSLVANDADSYRYLAESIRMHPDQDTLKAMMQDAGFESVDYYNLTAGVVALHRGYKF": 216,
      "MVSLEKNDHLMLARQLPLKSVALILAGGRGTRLKDLTNKRAKPAVHFGGKFRIIDFALSNCINSGIRRMGVITQYQSHTLVQHIQRGWSFFNEEMNEFVDLLPAQQRMKGENWYRGTADAVTQNLDIIRRYKAEYVVILAGDHIYKQDYSRMLIDHVEKGARCTVACMPVPIEEASAFGVMAVDENDKIIEFVEKPANPPSMPNDPSKSLASMGIYVFDADYLYELLEEDDRDENSSHDFGKDLIPKITEAGLAYAHPFPLSCVQSDPDAEPYWRDVGTLEAYWKANLDLASVVPELDMYDRNWPIRTYNESLPPAKFVQDRSGSHGMTLNSLVSGGCVISGSVVVQSVLFSRVRVNSFCNIDSAVLLPEVWVGRSCRLRRCVIDRACVIPEGMVIGENAEEDARRFYRSEEGIVLVTREMLRKLGHKQER": 217,
      "MAIERTFSIIKPNAVAKNVIGNIFARFEAAGFKIVGTKMLHLTVEQARGFYAEHDGKPFFDGLVEFMTSGPIVVSVLEGENAVQRHRDLLGATNPANALAGTLRADYADSLTENGTHGSDSVESAAREIAYFFGEGEVCPRTR": 218,
      "MAKHLFTSESVSEGHPDKIADQISDAVLDAILEQDPKARVACETYVKTGMVLVGGEITTSAWVDIEEITRNTVREIGYVHSDMGFDANSCAVLSAIGKQSPDINQGVDRADPLEQGAGDQGLMFGYATNETDVLMPAPITYAHRLVQRQAEVRKNGTLPWLRPDAKSQVTFQYDDGKIVGIDAVVLSTQHSEEIDQKSLQEAVMEEIIKPILPAEWLTSATKFFINPTGRFVIGGPMGDCGLTGRKIIVDTYGGMARHGGGAFSGKDPSKVDRSAAYAARYVAKNIVAAGLADRCEIQVSYAIGVAEPTSIMVETFGTEKVPSEQLTLLVREFFDLRPYGLIQMLDLLHPIYKETAAYGHFGREHFPWEKTDKAQLLRDAAGLK": 219,
      "MAKTIKITQTRSAIGRLPKHKATLLGLGLRRIGHTVEREDTPAVRGMVNAVSFMVKVEE": 220,
      "MANVTVTFTITEFCLHTGISEEELNEIVGLGVVEPREIQETTWVFDDHAAIVVQRAVRLRHELALDWPGIAVALTLMDDIAHLKQENRLLRQRLSRFVAHP": 221,
      "MARSVKKGPFCDAHLLKKVEAAAASRDKKPIKTWSRRSTILPDFIGLTIAVHNGRQHVPVYISENMVGHKLGEFALTRTFKGHAADKKAKK": 222,
      "MATNLRGVMAALLTPFDQQQALDKASLRRLVQFNIQQGIDGLYVGGSTGEAFVQSLSEREQVLEIVAEEAKGKIKLIAHVGCVSTAESQQLAASAKRYGFDAVSAVTPFYYPFSFEEHCDHYRAIIDSADGLPMVVYNIPALSGVKLTLDQINTLVTLPGVGALKQTSGDLYQMEQIRREHPDLVLYNGYDEIFASGLLAGADGGIGSTYNIMGWRYQGIVKALKEGDIQTAQKLQTECNKVIDLLIKTGVFRGLKTVLHYMDVVSVPLCRKPFGPVDEKYLPELKALAQQLMQERG": 223,
      "MDKFRVQGPTKLQGEVTISGAKNAALPILFAALLAEEPVEIQNVPKLKDVDTSMKLLSQLGAKVERNGSVHIDARDVNVFCAPYDLVKTMRASIWALGPLVARFGQGQVSLPGGCTIGARPVDLHISGLEQLGATIKLEEGYVKASVDGRLKGAHIVMDKVSVGATVTIMCAATLAEGTTIIENAAREPEIVDTANFLITLGAKISGQGTDRIVIEGVERLGGGVYRVLPDRIETGTFLVAAAISRGKIICRNAQPDTLDAVLAKLRDAGADIEVGEDWISLDMHGKRPKAVNVRTAPHPAFPTDMQAQFTLLNLVAEGTGFITETVFENRFMHVPELSRMGAHAEIESNTVICHGVEKLSGAQVMATDLRASASLVLAGCIAEGTTVVDRIYHIDRGYERIEDKLRALGANIERVKGE": 224,
      "MDLASLRAQQIELASSVIREDRLDKDPPDLIAGADVGFEQGGEVTRAAMVLLKYPSLELVEYKVARIATTMPYIPGFLSFREYPALLAAWEMLSQKPDLVFVDGHGISHPRRLGVASHFGLLVDVPTIGVAKKRLCGKFEPLSSEPGALAPLMDKGEQLAWVWRSKARCNPLFIATGHRVSVDSALAWVQRCMKGYRLPEPTRWADAVASERPAFVRYTANQP": 225,
      "MDMDLNNRLTEDETLEQAYDIFLELAADNLDPADVLLFNLQFEERGGAELFDPAEDWQEHVDFDLNPDFFAEVVIGLADSEDGEINDVFARILLCREKDHKLCHIIWRE": 226,
      "MFRGATLVNLDSKGRLSVPTRYREQLLENAAGQMVCTIDIHHPCLLLYPLPEWEIIEQKLSRLSSMNPVERRVQRLLLGHASECQMDGAGRLLIAPVLRQHAGLTKEVMLVGQFNKFELWDETTWHQQVKEDIDAEQLATGDLSERLQDLSL": 227,
      "MGRSLKKGPFVDEHLMKKVEAQANDEKKKVIKTWSRRSTIFPSFIGYTIAVYDGRKHVPVYIQEDMVGHKLGEFAPTRTYKGHAADDKKTRR": 228,
      "MINPNPKRSDEPVFWGLFGAGGMWSAIIAPVMILLVGILLPLGLFPGDALSYERVLAFAQSFIGRVFLFLMIVLPLWCGLHRMHHAMHDLKIHVPAGKWVFYGLAAILTVVTLIGVVTI": 229,
      "MKRTYQPSVTRRKRTHGFRVRMKTAGGRKVINARRAKGRKRLAI": 230,
      "MLNKLSLLLKDAGISLTDHQKNQLIAYVNMLHKWNKAYNLTSVRDPNEMLVRHILDSIVVAPYLQGERFIDVGTGPGLPGIPLSIVRPEAHFTLLDSLGKRVRFLRQVQHELKLENIEPVQSRVEEFPSEPPFDGVISRAFASLNDMVSWCHHLPGEQGRFYALKGQMPEDEIALLPEEYQVESVVKLQVPALDGERHLVVIKANKI": 231,
      "MNINVAELLNGNYILLLFVVLALGLCLGKLRLGSIQLGNSIGVLVVSLLLGQQHFSINTDALNLGFMLFIFCVGVEAGPNFFSIFFRDGKNYLMLALVMVGSALVIALGLGKLFGWDIGLTAGMLAGSMTSTPVLVGAGDTLRHSGMESRQLSLALDNLSLGYALTYLIGLVSLIVGARYLPKLQHQDLQTSAQQIARERGLDTDANRKVYLPVIRAYRVGPELVAWTDGKNLRELGIYRQTGCYIERIRRNGILANPDGDAVLQMGDEIALVGYPDAHARLDPSFRNGKEVFDRDLLDMRIVTEEVVVKNHNAVGKRLAQLKLTDHGCFLNRVIRSQIEMPIDDNVVLNKGDVLQVSGDARRVKTIADRIGFISIHSQVTDLLAFCAFFVIGLMIGMITFQFSTFSFGMGNAAGLLFAGIMLGFMRANHPTFGYIPQGALSMVKEFGLMVFMAGVGLSAGSGINNGLGAIGGQMLIAGLIVSLVPVVICFLFGAYVLRMNRALLFGAMMGARTCAPAMEIISDTARSNIPALGYAGTYAIANVLLTLAGTIIVMVWPGLG": 232,
      "MNLQHHFLIAMPALQDPIFRRSVVYICEHNTNGAMGIIVNKPLENLKIEGILEKLKITPEPRDESIRLDKPVMLGGPLAEDRGFILHTPPSNFASSIRISDNTVMTTSRDVLETLGTDKQPSDVLVALGYASWEKGQLEQEILDNAWLTAPADLNILFKTPIADRWREAAKLIGVDILTMPGVAGHA": 233,
      "MNQTLLSSFGTPFERVENALAALREGRGVMVLDDEDRENEGDMIFPAETMTVEQMALTIRHGSGIVCLCITEDRRKQLDLPMMVENNTSAYGTGFTVTIEAAEGVTTGVSAADRITTVRAAIADGAKPSDLNRPGHVFPLRAQAGGVLTRGGHTEATIDLMTLAGFKPAGVLCELTNDDGTMARAPECIEFANKHNMALVTIEDLVAYRQAHERKAS": 234,
      "MPELPEVETSRRGIEPHLVGATILHAVVRNGRLRWPVSEEIYRLSDQPVLSVQRRAKYLLLELPEGWIIIHLGMSGSLRILPEELPPEKHDHVDLVMSNGKVLRYTDPRRFGAWLWTKELEGHNVLAHLGPEPLSDDFNGEYLHQKCAKKKTAIKPWLMDNKLVVGVGNIYASESLFAAGIHPDRLASSLSLAECELLARVIKAVLLRSIEQGGTTLKDFLQSDGKPGYFAQELQVYGRKGEPCRVCGTPIVATKHAQRATFYCRQCQK": 235,
      "MQLKRVAEAKLPTPWGDFLMVGFEELATGHDHVALVYGDISGHTPVLARVHSECLTGDALFSLRCDCGFQLEAALTQIAEEGRGILLYHRQEGRNIGLLNKIRAYALQDQGYDTVEANHQLGFAADERDFTLCADMFKLLGVNEVRLLTNNPKKVEILTEAGINIVERVPLIVGRNPNNEHYLDTKAEKMGHLLNK": 236,
      "MRKNTYAMRYVAGQPAERILPPGSFASIGQALPPGEPLSTEERIRILVWNIYKQQRAEWLSVLKNYGKDAHLVLLQEAQTTPELVQFATANYLAADQVPAFVLPQHPSGVMTLSAAHPVYCCPLREREPILRLAKSALVTVYPLPDTRLLMVVNIHAVNFSLGVDVYSKQLLPIGDQIAHHSGPVIMAGDFNAWSRRRMNALYRFAREMSLRQVRFTDDQRRRAFGRPLDFVFYRGLNVSEASVLVTRASDHNPLLVEFSPGKPDK": 237,
      "MRNFDLSPLMRQWIGFDKLANALQNAGESQSFPPYNIEKSDDNHYRITLALAGFRQEDLEIQLEGTRLSVKGTPEQPKEEKKWLHQGLMNQPFSLSFTLAENMEVSGATFVNGLLHIDLIRNEPEPIAAQRIAISERPALNS": 238,
      "MSIQNEMPGYNEMNQYLNQQGTGLTPAEMHGLISGMICGGNDDSSWLPLLHDLTNEGMAFGHELAQALRKMHSATSDALQDDGFLFQLYLPDGDDVSVFDRADALAGWVNHFLLGLGVTQPKLDKVTGETGEAIDDLRNIAQLGYDEDEDQEELEMSLEEIIEYVRVAALLCHDTFTHPQPTAPEVQKPTLH": 239,
      "MSITLSDSAAARVNTFLANRGKGFGLRLGVRTSGCSGMAYVLEFVDEPTPEDIVFEDKGVKVVVDGKSLQFLDGTQLDFVKEGLNEGFKFTNPNVKDECGCGESFHV": 240,
      "MSKPFKLNSAFKPSGDQPEAIRRLEEGLEDGLAHQTLLGVTGSGKTFTIANVIADLQRPTMVLAPNKTLAAQLYGEMKEFFPENAVEYFVSYYDYYQPEAYVPSSDTFIEKDASVNEHIEQMRLSATKAMLERRDVVVVASVSAIYGLGDPDLYLKMMLHLTVGMIIDQRAILRRLAELQYARNDQAFQRGTFRVRGEVIDIFPAESDDIALRVELFDEEVERLSLFDPLTGQIVSTIPRFTIYPKTHYVTPRERIVQAMEEIKEELAARRKVLLENNKLLEEQRLTQRTQFDLEMMNELGYCSGIENYSRFLSGRGPGEPPPTLFDYLPADGLLVVDESHVTIPQIGGMYRGDRARKETLVEYGFRLPSALDNRPLKFEEFEALAPQTIYVSATPGNYELEKSGGDVVDQVVRPTGLLDPIIEVRPVATQVDDLLSEIRQRAAINERVLVTTLTKRMAEDLTEYLEEHGERVRYLHSDIDTVERMEIIRDLRLGEFDVLVGINLLREGLDMPEVSLVAILDADKEGFLRSERSLIQTIGRAARNVNGKAILYGDKITPSMAKAIGETERRREKQQKYNEEHGITPQGLNKKVVDILALGQNIAKTKAKGRGKSRPIVEPDNVPMDMSPKALQQKIHELEGLMMQHAQNLEFEEAAQIRDQLHQLRELFIAAS": 241,
      "MSKTLNIIWQYLRAFVLIYACLYAGIFIASLLPVTIPGSIIGMLILFVLLALQILPAKWVNPGCYVLIRYMALLFVPIGVGVMQYFDLLRAQFGPVVVSCAVSTLVVFLVVSWSSQLVHGERKVVGQKGSEE": 242,
      "MTDYLLLFVGTVLVNNFVLVKFLGLCPFMGVSKKLETAMGMGLATTFVMTLASICAWLIDTWILIPLNLIYLRTLAFILVIAVVVQFTEMVVRKTSPVLYRLLGIFLPLITTNCAVLGVALLNINLGHNFLQSALYGFSAAVGFSLVMVLFAAIRERLAVADVPAPFRGNAIALITAGLMSLAFMGFSGLVKL": 243,
      "MTEAQRHQILLEMLAQLGFVTVEKVVERLGISPATARRDINKLDESGKLKKVRNGAEAITQQRPRWTPMNLHQAQNHDEKVRIAKAASQLVNPGESVVINCGSTAFLLGREMCGKPVQIITNYLPLANYLIDQEHDSVIIMGGQYNKSQSITLSPQGSENSLYAGHWMFTSGKGLTAEGLYKTDMLTAMAEQKMLSVVGKLVVLVDSSKIGERAGMLFSRADQIDMLITGKNANPEILQQLEAQGVSILRV": 244,
      "MTNRLVLSGTVCRTPLRKVSPSGIPHCQFVLEHRSVQEEAGFHRQAWCQMPVIVSGHENQAITHSITVGSRITVQGFISCHKAKNGLSKMVLHAEQIELIDSGD": 245,
      "MTQPLFLIGPRGCGKTTVGMALADSLNRRFVDTDQWLQSQLNMTVAEIVEREEWAGFRARETAALEAVTAPSTVIATGGGIILTEFNRHFMQNNGIVVYLCAPVSVLVNRLQAAPEEDLRPTLTGKPLSEEVQEVLEERDALYREVAHIIIDATNEPSQVISEIRSALAQTINC": 246,
